#include "../inc/swilib.h"
#include "../inc/cfg_items.h"
#include "../inc/stdbool.h"
#include "../inc/playsound.h"
#include "../inc/obs.h"
#include "conf_loader.h"
#include "main.h"
#include "mainmenu.h"
#include "sets_menu.h"
#include "playlist.h"
#include "lang.h"
#include "langpack.h"
#include "SPlayer_ipc.h"
#include "mylib.h" 
#include "../inc/xtask_ipc.h"

/*
typedef struct {
 unsigned short type; //00 
 WSHDR *wfilename; //04 
 int unk_08 ; //08 
 int unk_0C; //0C 
 int unk_10 ; //10 
 int unk_14 ; //14 
 long length; //18 <-- return 
 int unk_1C; //1C 
 int unk_20 ; //20 
} TWavLen;*/

#pragma swi_number=0x45 
#ifdef NEWSGOLD 
__swi __arm int GetWavLen(char *filename); 
#else 
__swi __arm int GetWavLen(TWavLen *wl);
#endif

#ifdef NEWSGOLD
#define DEFAULT_DISK "4"
#else
#define DEFAULT_DISK "0"
#endif

void Log(int dummy, char *txt)
{
  unsigned int ul;
  int f=fopen("0:\\SPlayer.log",A_ReadWrite+A_Create+A_Append+A_BIN,P_READ+P_WRITE,&ul);
  if (f!=-1)
  {
    fwrite(f,txt,strlen(txt),&ul);
  }
  fclose(f,&ul);
}

const int minus11=-11; // стремная константа =)

unsigned short maincsm_name_body[140];
unsigned int MAINCSM_ID = 0;
unsigned int MAINGUI_ID = 0;

//IPC   AAA
const char ipc_my_name[32]=IPC_SPLAYER_NAME;
const char ipc_xtask_name[]=IPC_XTASK_NAME;
const char ipc_grantee_name[]=IPC_GRANTEE_NAME;
const char ipc_control_name[]=IPC_CONTROL_NAME;
const char ipc_editor_name[]=IPC_EDITOR_NAME;
IPC_REQ gipc;

WSHDR* SPerrs;

extern short ModeRew;
extern short ModeMove;
