//----------------COLORS----------------------
typedef char const* color;

const char NULLL[]={0,0,0,0};

const char WHITE[]={255,255,255,100};
const char BLACK[]={0,0,0,100};
const char GRAY[]={128,128,128,100};

const char RED[]={255,0,0,100};
const char GREEN[]={0,255,0,100};
const char BLUE[]={0,0,255,100};

const char YELLOW[]={255,255,0,100};
const char CYAN[]={0,255,255,100};
const char PURPLE[]={255,0,255,100};

const char ORANGE[]={255,165,0,100};
const char GOLD[]={255,215,0,100};
const char DARKGOLD[]={218,165,32,100};
const char BROWN[]={160,40,20,100};
const char DARKBROWN[]={0x86,0x45,0x13,100};


const char OBLACK[]={0,0,0,20};
const char SBLACK[]={0,0,0,50};
const char ORED[]={255,0,0,20};
const char OGREEN[]={0,255,0,20};
const char OBLUE[]={0,0,255,20};
const char OBROWN[]={160,40,20,20};
//----------------Terrain types------------
/*#define GROUND 1
#define BRICK 2

#define FOREST_UP 75
#define FOREST_CENT 76
#define FOREST_DOWN 77

#define SEA 21

#define FLAME 100

#define COAST_NW 17
#define COAST_N 18
#define COAST_NE 19
#define COAST_E 20
#define COAST_SE 23
#define COAST_S 24
#define COAST_SW 25
#define COAST_W 22*/

const char *GetTerrainNames[255] = 
{
"Еррор",  //0
"Земля",  //1
"Золото",  //2
"Камни",  //3
"Земля",  //4
"Растения",  //5
"Земля2",  //6
"След",  //7
"Земля3",  //8
"След двойной",  //9
"Земля",  //10
"Земля",  //11
"Земля",  //12
"Земля",  //13
"Земля",  //14
"Земля",  //15
"Земля",  //16
"СЗ пепелище",  //17
"С пепелище",  //18
"СВ пепелище",  //19
"З пепелище",  //20
"Ц пепелище",  //21
"В пепелище",  //22
"ЮЗ пепелище",  //23
"Ю пепелище",  //24
"ЮВ пепелище",  //25
"Мост",  //26
"Мост",  //27
"Мост",  //28
"Мост",  //29
"Мост",  //30
"Мост",  //31
"Мост",  //32
"Мост",  //33
"Мост",  //34
"Мост",  //35
"Мост",  //36
"Мост",  //37
"Мост",  //38
"Мост",  //39
"Мост",  //40
"Мост",  //41
"Мост",  //42
"Мост",  //43
"Тропа Ю-В",  //44
"Тропа З-В",  //45
"Тропа 3-Ю-В",  //46
"Тропа Ю-С",  //47
"Тропа Ю-З",  //48
"Тропа 3-С-В",  //49
"",  //50
"Тропа 3-С",  //51
"Тропа С-В",  //52
"",  //53
"",  //54
"",  //55
"Земля",  //56
"",  //57
"",  //58
"",  //59
"",  //60
"",  //61
"",  //62
"",  //63
"",  //64
"",  //65
"",  //66
"",  //67
"",  //68
"",  //69
"",  //70
"",  //71
"",  //72
"",  //73
"",  //74
"Лес",  //75
"Лес",  //76
"Лес",  //77
"",  //78
"",  //79
"",  //80
"",  //81
"",  //82
"",  //83
"",  //84
"",  //85
"",  //86
"",  //87
"Здание",  //88
"Здание",  //89
"Здание",  //90
"арба",  //91
"Крепость",  //92
"",  //93
"",  //94
"Селдрик",  //95
"",  //96
"",  //97
"",  //98
"",  //99
"Огонь",  //100
"Вода",  //101
"Вода",  //102
"",  //103
"Вода",  //104
"Вода",  //105
"",  //106
"",  //107
"",  //108
"",  //109
"",  //110
"",  //111
"",  //112
"",  //113
"",  //114
"",  //115
"",  //116
"",  //117
"",  //118
"",  //119
"",  //120
"",  //121
"",  //122
"",  //123
"",  //124
"",  //125
"",  //126
"",  //127
"",  //128
"",  //129
"",  //130
"",  //131
"",  //132
"",  //133
"",  //134
"",  //135
"",  //136
"",  //137
"",  //138
"",  //139
"",  //140
"",  //141
"",  //142
"",  //143
"",  //144
"",  //145
"",  //146
"",  //147
"",  //148
"",  //149
"",  //150
"",  //151
"",  //152
"",  //153
"",  //154
"",  //155
"",  //156
"",  //157
"",  //158
"",  //159
"",  //160
"",  //161
"",  //162
"",  //163
"",  //164
"",  //165
"",  //166
"",  //167
"",  //168
"",  //169
"",  //170
"",  //171
"",  //172
"",  //173
"",  //174
"",  //175
"",  //176
"",  //177
"",  //178
"",  //179
"",  //180
"",  //181
"",  //182
"",  //183
"",  //184
"",  //185
"",  //186
"",  //187
"",  //188
"" //189
};
