
void onredraw(void);
void init();
void *memset(void *mem, int val, int size);
void drawtetris();
void drawhelp();
void savegame();
void loadgame();
int putfig(int action);
int newfig();
void delines();
void drawstak();
void newgame();
void down(int loop);

signed char fig[]={ // Коорд. фигур с поворотами
//квадрат
0,0,1,0,0,1,1,1,
0,0,1,0,0,1,1,1,
0,0,1,0,0,1,1,1,
0,0,1,0,0,1,1,1,
//треуг-к
-1,0,0,0,1,0,0,1,
0,0,1,0,0,1,0,-1,
0,0,1,0,-1,0,0,-1,
0,0,-1,0,0,-1,0,1,
//прямая
0,0,-1,0,1,0,2,0,
0,0,0,-1,0,1,0,2,
0,0,-1,0,1,0,2,0,
0,0,0,-1,0,1,0,2,
//изогнутая влево
0,0,-1,0,-1,-1,0,1,
0,0,1,0,0,1,-1,1,
0,0,-1,0,-1,-1,0,1,
0,0,1,0,0,1,-1,1,
//изогнутая вправо
0,0,0,-1,-1,0,-1,1,
0,0,-1,0,0,1,1,1,
0,0,0,-1,-1,0,-1,1,
0,0,-1,0,0,1,1,1,
//Г
0,0,-1,0,1,0,1,1,
0,0,0,-1,1,-1,0,1,
0,0,-1,0,1,0,-1,-1,
0,0,0,-1,0,1,-1,1,
//обр. Г
0,0,1,0,-1,0,-1,1,
0,0,0,-1,0,1,1,1,
0,0,-1,0,1,0,1,-1,
0,0,0,-1,0,1,-1,-1};
