Оцените </HITPARAD/> этот текст:


          Хорхе Луис Борхес. Думая вслух



---------------------------------------------------------------
     OCR: Phiper
     Книга. Перевод Ю. Ванникова
     Бессмертие. Перевод Б.Дубина
     Эмануэль Сведенборг. Перевод Ю. Ванникова
     Детектив. Перевод Б.Дубина
     Время. Перевод Ю. Ванникова
---------------------------------------------------------------


          БЕССМЕРТИЕ


     В одной из  своих  -- как одна  прекрасных  --  книг,  в  "Многообразии
религиозного  опыта",  Уильям  Джемс  отводит  личному бессмертию не  больше
страницы. Для него это проблема второстепенная.
     Ее и правда не отнесешь к основополагающим, таким, как время, познание,
реальность.  По словам  Джемса, личное  бессмертие  путают  с  религией  как
таковой.  Практически для каждого, пишет он, "Бог -- это  творец бессмертия,
причем бессмертия личного".
     Не  замечая  комизма,  эту  формулу  дословно воспроизводит  Мигель  де
Унамуно  в "Трагическом чувстве жизни". Он так  и  пишет: "Бог -- это творец
бессмертия", многократно повторяя при этом, что  хотел  бы навсегда остаться
доном  Мигелем де Унамуно. Здесь наши вкусы с Мигелем де Унамуно расходятся:
я  вовсе  не  хотел бы остаться Хорхе Луисом Борхесом, я хочу  быть  другим.
Почему и надеюсь,  что смерть моя будет окончательной и  я умру целиком -- и
душой и телом. Не знаю, скромно или нет, да и оправданно ли вообще, говорить
о личном бессмертии -- бессмертии души, хранящей память о пережитом на земле
или вспоминающей ее в мире  ином.  Помню, моя сестра Нора была как-то дома и
сказала:  "Я хочу  написать  картину  "Ностальгия  по  земному миру"  -- что
чувствует  удостоенный  неба, когда  думает  о  земле. Там  будет  что-то от
Буэнос-Айреса времен моего детства". У меня  есть стихотворение  на  эту  же
тему, Нора его не  знает. Оно  про Иисуса, которому вспоминаются галилейские
дожди,  запах плотницкой  и то,  чего он  никогда  не  видал в раю и  о  чем
тоскует, -- звездное небо.
     Эта небесная тоска по земному -- тема стихов Данте Габриэля Россетти. У
него говорится о девушке, которая на небе тоскует по любимому, которого  нет
рядом: она надеется, что  рано или  поздно он придет к ней, но он не придет,
потому что приговорен к адским мукам, а она будет ждать его вечно.
     Итак,  для  Уильяма Джемса эта  проблема --  не  самая  важная. Главные
проблемы философии -- это время,  реальность, познание. Бессмертию отводится
второстепенное место:  оно -- достояние не столько философии, сколько поэзии
или, скажем, богословия, да и то лишь для некоторых богословов.
     Есть другая версия бессмертия  --  переселение душ. В ней действительно
есть поэзия и куда больше занимательности, чем в обычной -- оставаться самим
собой и вспоминать о прошлом, идее, я бы сказал, весьма небогатой.
     Я помню десять--двенадцать  картин своего  детства и, говоря по правде,
стараюсь  их позабыть. А когда вспоминаю об отрочестве, не могу  смириться с
тем,  каким  был  тогда,  и  хотел  бы  стать  другим.  Но  искусство  может
преобразить все это, сделать его достоянием поэзии.
     Самый задушевный из философских текстов -- думаю, помимо воли автора --
это платоновский "Федон".  Речь там идет о последнем вечере  Сократа, друзья
уже знают, что с  Делоса прибыл корабль и Сократ приговорен  выпить до конца
дня  чашу с цикутой. Сократ принимает их у  себя в застенке,  он тоже знает,
что  обречен.   Среди   собравшихся  нет  одного.   Дальше   следует  фраза,
трогательней  которой,  как  заметил  Макс Брод,  Платон  ничего в жизни  не
написал. Фраза такая: "Платон,  кажется, заболел".  Это,  подчеркивает Брод,
единственное  упоминание  Платона  о себе во всех его  пространных диалогах.
Поскольку  диалог  пишет  Платон,   он,  разумеется,  присутствует   --  или
отсутствует, это  одно и то  же, -- но называет себя в третьем лице. Так или
иначе, остается  какая-то неопределенность, где же он на самом деле был в ту
великую минуту.
     Платон, можно предположить, вставил эту фразу,  чтобы  чувствовать себя
свободней, как  бы говоря: "Я  не знаю,  что говорил Сократ в свой последний
вечер, но мне хотелось, чтобы он  говорил  так".  Или: "Представим,  что  он
говорил так".
     По-моему, Платон чувствовал редкостную литературную красоту этой фразы:
"Платон, кажется, заболел".
     Дальше  следует  поразительная  реплика, может быть, это  вообще  самое
поразительное место диалога. Друзья входят, Сократ сидит на постели, кандалы
уже сняты. Он дает  ногам отдохнуть,  рад, что больше не  чувствует  тяжести
цепей, и говорит: "Удивительное дело. Цепи мучили меня, заставляли страдать.
А теперь  их  сняли и  мне  легче.  Радость  и страдание  неразлучны  -- как
близнецы". .
     Поразительно.  В  такую минуту, в свой  последний день он  говорит не о
близкой  смерти,  а  рассуждает  о связи  радости  и  страдания.  Это  самая
трогательная  реплика  в  платоновских  диалогах.  За  ней  --  мужественный
человек, человек, обреченный на скорую смерть,  но не  удостаивающий ее даже
слова.
     Дальше говорится о яде, который предстоит выпить до  конца дня, а затем
собеседники  переходят  к  проблеме,  на  наш  теперешний  взгляд совершенно
ложной: они обсуждают двойственную природу человека, две его составные части
--  душу  и  тело.  По мнению  Сократа, психическая субстанция  (душа)  рада
освободиться от тела, которое ей только мешает. Он ссылается на общепринятое
у древних представление о душе, замурованной в темнице тела.
     Здесь я хотел бы напомнить  стихи  большого  английского поэта  Руперта
Брука, который  -- это прекрасная поэзия, хотя, наверно, слабая философия --
говорит  так:  "И  тогда, за  чертой  смерти,  мы коснемся  сути,  больше не
нуждаясь в руках, и увидим ее, уже не  ослепленные зрением". Это,  повторяю,
высокая  поэзия,  хотя   сомнительная  философия.  Густав  Шпиллер  в  своем
замечательном  труде по психологии пишет, что  мысль  об испытаниях  тела --
скажем, увечье,  ударе  по  голове  --  нисколько  не  благотворна для души.
Поэтому непонятно, чем бы могло помочь душе уничтожение тела. Однако верящий
в обе эти реальности -- душу и тело -- Сократ считает,  будто освободившаяся
от тела душа сможет без помех предаться мысли.
     Это напоминает историю о Демокрите. Как рассказывают, он однажды в саду
вырвал себе глаза, чтобы не  отвлекаться на окружающее. Легенда скорей всего
выдуманная,  но  по-своему красивая. Человек видит во  внешнем  мире -- мире
семи цветов, которых я не различаю, -- помеху  для чистого разума и вырывает
себе глаза, чтобы мыслить свободно.
     Для  нас  теперь  эти  рассуждения  о  душе и  теле  звучат не  слишком
убедительно.  Обратимся на несколько минут  к  истории философии.  Для Локка
существуют  лишь  ощущения  и  восприятия, а также воспоминания и восприятия
этих ощущений, иначе  говоря  --  материя  и данные о ней пяти наших чувств.
Беркли,  следом за ним,  подхватывает мысль о материи как последовательности
восприятий,  которые  непостижимы  без  воспринимающего  разума.  Что  такое
красный  цвет? Цвета  зависят от зрения, а  зрение --  это, в свою  очередь,
способ восприятия.  Позже  в  дискуссию вмешивается  Юм.  Он  отвергает  обе
гипотезы и ставит под вопрос само существование  души  и тела. Разве душа не
есть  нечто воспринимающее, а тело  -- нечто воспринятое?  Поскольку же  оба
существительных  упразднены,  остаются  только  глаголы.   По   словам  Юма,
выражение "я  мыслю"  незаконно, поскольку  это  "я"  вводит представление о
субъекте.  Правильней говорить  "мыслится", как мы говорим "льет".  В  обоих
случаях речь идет о действиях, не имеющих субъекта. И  вместо своего "мыслю,
стало  быть,  существую"  Декарту следовало бы сказать "если кто-то  мыслит"
или, еще  верней, "если  мыслится", иначе вводится отдельная сущность "я", а
подобное допущение  неоправданно. Надо  говорить: "Если мыслят, стало  быть,
что-то существует".
     Но вернемся к  личному  бессмертию. Некоторые доводы в его пользу есть.
Процитирую  два.  Фехнер рассуждает так: в сознании человека немало желаний,
порывов,  надежд и  страхов,  которые  никак не умещаются  в  отмеренную нам
жизнь. Слова  Данте:  "Nel mezzo  del cammin  de  nostra vita"  ("Посередине
странствия земного") -- напоминают, что Писание  отводит человеку  семьдесят
лет жизни. Достигнув середины этого срока, тридцати пяти лет, Данте и увидел
то,  что  потом описывает.  Каждый  из  нас за  свои семьдесят  лет (я, увы,
перешел  за этот предел, мне уже семьдесят восемь) перечувствовал  множество
того, что никак  не относится к  этой жизни,  не имеет  в  ней ни  малейшего
смысла. Фехнер вспоминает о зародыше, еще не покинувшем  материнскую утробу.
У него есть совершенно  бесполезные ноги, руки, пальцы, и все это ему  здесь
совершенно  не нужно, а пригодится лишь в будущей  жизни. Может быть, с нами
то же самое? Нас переполняют страхи и догадки, смысл которых в этой короткой
жизни мы  не в  силах  понять.  Мы  понимаем  лишь  то, что объединяет нас с
животным миром, а в нем на другую, более полную жизнь ничего не откладывают.
Таков один из доводов в пользу бессмертия.
     Обратимся  к  высшему  авторитету -- Святому  Фоме Аквинскому, которому
принадлежит такая мысль: "In-tellectus  naturaliter  desiderat  esse semper"
("Разум  по природе хочет быть вечным"). Можно возразить, что  у  него  есть
немало других желаний. Например, зачастую
     он  хочет,  наоборот, умереть. Мы знаем  случаи самоубийств, у нас есть
знакомые,  которых   круглые  сутки  клонит  ко  сну,  а   он  --  одна   из
разновидностей конца.  Есть множество стихов об отраде смерти.  Скажем,  вот
этот безымянный испанский куплет:
     Возьми меня, смерть, украдкой,
     скользни косой незаметной,
     чтоб сладостной муке смертной
     не длить моей жизни краткой.
     Или севильский аноним:
     В чем совершенство, если нам изменит
     Умеренность? О Смерть, приди тайком,
     Пусть тихая стрела меня заденет,
     Нет, не в машине с громом и огнем --
     Явись неслышно, сил не тратя всуе,
     Поскольку я не запираю дом.
     Есть еще строфа у французского поэта Леконта де Лиля: "Освободи меня от
времени, пространства и числа и верни отнятый ими покой".
     Нас переполняет множество  желаний. Одно из  них --  жить, существовать
вечно;  другое  --  умереть.  А  есть еще  страх  и его оборотная сторона --
надежда. Но все это вполне может обойтись без всякого личного бессмертия, не
нуждается в нем. Если  говорить о себе, то я его не хочу и даже боюсь.  Было
бы ужасно оказаться вечным, так и существовать Борхесом. Я устал от себя, от
своего имени, от своей известности и хотел бы покончить с этим.
     Есть еще незаконная сделка с вечностью, о которой упоминает  Тацит, чьи
слова подхватывает Гете.  Тацит в  "Жизнеописании Агриколы" пишет:  "Великие
души не распадаются вместе с телом". Он верит, что личное бессмертие -- дар,
уготованный  избранным:  черни  в нем  отказано,  но  отличенные  души могут
удостоиться бессмертия и, причастившись  Лете, о которой говорит Сократ, все
же не  забудут о  прежней жизни. Эту  мысль подхватывает Гете,  после смерти
своего  друга  Виланда  он   пишет:  "Страшно  подумать,   что  Виланд  ушел
безвозвратно".  Он не  может  себе  представить,  что  Виланда  нет, хотя бы
где-нибудь; он верит в отдельное бессмертие для Виланда, но не для всех.  То
же самое у Тацита:
     "Nunc  cum corpore periunt magnae animae". Мы лелеем мысль о бессмертии
как  привилегии  избранных, великих.  Но каждый считает великим себя, каждый
цепляется  за мысль,  что бессмертие предназначено именно ему. Я  в  это  не
верю. Да и кроме того,  есть другие, более интересные  версии бессмертия.  В
первую  очередь, догадка  о  перевоплощении.  Она встречается у Пифагора,  у
Платона.  Платон рассматривает перевоплощение как одну из возможностей.  Для
него оно  объясняло бы нашу удачливость или невезучесть.  Своими радостями и
бедами в этой  жизни мы обязаны прежнему существованию, это награда или кара
за него. Но есть тут одна неразрешимая трудность. Если, как верят индуисты и
буддисты, жизнь каждого определяется его предыдущей жизнью, то ведь и она, в
свою  очередь, определяется  предыдущей, и  так далее до  бесконечных глубин
прошлого.
     Но если время и впрямь  бесконечно,  то представление о  бесконечности,
уводящей  в  прошлое,  -- явное  противоречие.  Если  оно бесконечно, то как
добирается  до нынешнего дня?  Допустим, время не имеет конца. Но  тогда это
бесконечное  время содержит в  себе, по-моему, любое  настоящее.  А в  таком
случае -- почему бы не это, в Бельграно, в университете, где  вы все  вместе
сидите  передо мной?  Почему  нет?  Если время бесконечно, центром его может
быть любой миг.
     Для  Паскаля  бесконечная  вселенная -- это сфера,  окружность  которой
повсюду, а центр -- нигде. Тогда почему не представить, что за этим мигом --
бесконечное прошлое,  бесконечное  былое? Почему не представить, что все это
прошлое сходится именно  в этом мгновении? В любой миг мы  на самой середине
бесконечной  прямой,  а любая  точка  этого  бесконечного  центра  --  центр
вселенной, поскольку и пространство и время не имеют конца.
     Буддисты  верят,  что  каждый из  нас  прожил бесконечное число жизней.
Бесконечное в прямом смысле слова:  у него нет предела, это число без начала
и  конца,  что-то  вроде  трансфинитных  чисел  в  современной  математике у
Кантора. И каждый сейчас --  ведь любой миг это центр --  находится в  самом
центре  подобного бесконечного времени.  И вот мы с вами разговариваем, и вы
думаете о том, что я сейчас сказал, принимаете или отвергаете.
     Перевоплощение дает душе возможность переселяться из тела  в  тело -- в
людей или в растения. Есть поэма Эмпедокла из Агригента, где рассказывается,
как он узнает  щит, с которым воевал  под Троей. Есть поэма "The Progress of
the Soul"  ("Путь души") Джона  Донна,  писавшего чуть  позже Шекспира.  Она
начинается словами: "Воспою путь бесконечной души", и  эта душа переходит из
тела  в тело. Донн задумал  книгу,  которая, вслед за Писанием, превзошла бы
все  книги  на  свете.  Честолюбивый замысел  не  удался,  но  подарил  миру
несколько удачных строк. Сначала душа вселяется в яблоню, в ее плоды, точнее
-- в Адамово яблоко, поросль греха. Так она попадает в утробу Евы, вселяется
в Каина и  с каждой  новой строфой  переходит  в  новое  тело  (одно  из них
принадлежит Елизавете  Английской).  Поэма  так  и  осталась  незаконченной,
поскольку Донн верил в  бессмертие души, переходящей из тела в тело. В одном
из  предисловий  он  вспоминает  прославленных предшественников,  отсылая  к
учениям Пифагора и  Платона о переселении душ. Он говорит о двух источниках:
Пифагоре и идее переселения душ,  к которой как  последнему  доводу приходит
Сократ.
     Замечу,  что  Сократ,  беседуя  с друзьями в  тот вечер,  прощается без
малейшего пафоса. Он  отправляет  домой  жену и детей, грозится отправить  и
всплакнувшего  было друга и вообще хотел бы спокойно  поговорить, просто еще
немного  поговорить, немного  подумать. Близость смерти не  пугает  его. Его
задача, его дело -- в другом: рассуждать, и рассуждать по возможности ясно.
     Почему  же он все-таки  выпивает цикуту? Никакой  разумной причины  для
этого нет.
     Он заводит речь  о диковинных вещах. Что Орфею предназначено обратиться
в соловья, пастырю народов Агамемнону -- в орла, а Улиссу, как ни странно, в
самого ничтожного и неприметного  из людей. Сократ  говорит,  его  прерывает
смерть.  Голубая смерть уже поднимается  по ногам. Цикута выпита. Он  просит
одного  из  друзей  принести  за  него в  жертву  Асклепию петуха.  Он хочет
сказать,  что бог медицины Асклепий излечил его от  самого тяжкого недуга --
от  жизни. "Я  задолжал Асклепию петуха, ведь он  излечил меня  от жизни,  я
умираю".  Иными  словами,  он  перечеркивает  все,  что  говорил  раньше,  и
понимает, что сейчас умрет.
     Есть  еще один классический текст, опровергающий личное бессмертие, это
"De rerum naturae" Лукреция.  Самый сильный из  доводов автора таков:  некто
жалуется на предстоящую  смерть. Сокрушается, что лишен будущего. Как  писал
Виктор  Гюго: "Я один  ухожу посреди  праздника,  а сияющий и счастливый мир
ничего не замечает". Так вот, в своей известной поэме, не менее честолюбивой
по  замыслу,  чем  донновская,  "De  rerum  naturae",  или "De  rerum dedala
naturae"  ("О  скрытой  природе  вещей"),  Лукреций прибегает  к  следующему
доводу: "Ты жалуешься на отнятое будущее, но подумай о  бесконечном прошлом.
Когда ты явился на свет, -- внушает Лукреций читателю, -- пора сражений Трои
и Карфагена за власть над миром давно прошла. И если это тебя не заботит, то
чем  так заботит еще не наставшее? Если ты  потерял  бесконечное прошлое, то
почему страшишься потерять бесконечное  будущее?" Так пишет Лукреций.  Жаль,
что  мой  латинский  слишком  слаб,  чтобы вспомнить  эти  прекрасные стихи,
которые я перечитал на днях с помощью словаря.
     Шопенгауэр  (а он для  меня авторитет высочайший)  заявил, что за идеей
перевоплощения кроется другая, увлекшая поздней Шоу и Бергсона, --  расхожая
идея воли к жизни. Есть нечто, стремящееся к  жизни, прокладывая путь сквозь
материю и даже наперекор материи. Шопенгауэр  называет  эту силу, вносящую в
мир тягу к возрождению, волей (Wille).
     Шоу позднее назовет это жизненной силой (the life force), а  Бергсон, в
конце концов, жизненным порывом (1'elan vital), который являет себя во всем,
творит  мир и движет  каждым  из нас. В рудах он  как бы  умер,  в растениях
уснул, в животных  дремлет, но только в нас приходит к  самоосознанию. Это и
объясняет  фразу  Святого  Фомы:  "Intellectus  naturaliter  desiderat  esse
semper", "Разум по природе хочет быть вечным". Но в какой форме? Конечно же,
не в личной, не в понимании Унамуно, который хотел бы остаться Унамуно, а во
всеобщей.
     Наше "я"  в нас  не самое  важное.  Что значит  чувствовать себя  самим
собой? Чем  отличаюсь я, чувствующий  себя  Борхесом, от других, чувствующих
себя тем-то и тем-то? Да абсолютно ничем. На самом деле, это наше общее "я",
и оно в той или иной форме присутствует в каждом. Поэтому и можно говорить о
потребности  в бессмертии, но не в личном, а в этом, другом, смысле. Скажем,
всякий, кто  возлюбил врага своего, соучаствует в бессмертии  Христа. В этот
миг  он Христос.  Повторяя строку Данте или Шекспира, мы каждый  раз так или
иначе  перевоплощаемся  в миг,  когда Шекспир  и Данте эту строку создавали.
Наше бессмертие --  в памяти других, в трудах,  которые мы им оставляем. Так
не все ли равно, чье имя носят эти труды?
     Последние  двадцать лет я отдал англосаксонской поэзии, многие  стихи я
знаю на  память. Единственное, чего я не знаю, так это имен их авторов. Ну и
что? Разве в этом дело, если  я, читая  стихи девятого века,  вдруг чувствую
что-то, волновавшее человека того столетия? Он живет во мне в этот миг, хотя
я -- не он. В каждом из нас -- все жившие до нас  на свете. Все, а не только
наши родные.
     А  родные  тем более. Я  знаю, со слов матери, что  цитирую  английские
стихи голосом отца.  (Он  умер в  тридцать восьмом, в том же году покончил с
собой Лугонес.)  Когда я повторяю стихи Шиллера,  во  мне живет  мой отец. И
другие люди, которых  я слышал, --  они живут в моем голосе, ставшем эхом их
голосов, как сами они  скорей всего были эхом  своих предков. Что  тут можно
знать наверняка? Короче говоря, мы вправе верить в бессмертие.
     Все мы, так или иначе,  сотоварищи по  этому миру. Каждый  хочет, чтобы
мир был лучше,  и, если он вправду становится  лучше,  наши надежды крепнут.
Если родина чем-то  прославится  (почему бы и  нет?),  в  этой  славе  будет
частица нашего бессмертия,  и неважно,  вспомнят  наши имена  или  нет.  Это
пустяк.  Важно другое -- бессмертие. Оно  -- в  делах, в памяти, оставленной
другим.
     Остаться может совсем немного, фраза, не больше. Скажем, такая:  "Ну  и
парень,  повстречаешь --  не  разойдешься".  Кто ее  выдумал, не  знаю,  но,
произнося,  всякий  раз  чувствую  себя  автором.  И разве важно,  что  того
куманька давно нет  на свете, если он в  эту минуту живет во мне и в каждом,
кто повторяет его фразу?
     То же самое -- с музыкой или с языком. Язык -- это общий труд, а потому
бессмертен. Я говорю по-испански. Сколько умерших испанцев живут во мне? Что
я думаю  и как сужу, не важно, имена ушедших тоже не так важны, если все  мы
день  за  днем  помогаем осуществиться будущему,  бессмертию,  нашему общему
бессмертию.
     Это  бессмертие  вовсе  не  обязано  быть  твоей   собственностью,  оно
обойдется без случайных фамилий  и имен, обойдется  без наших  воспоминаний.
Зачем  считать, что возьмешь в другую жизнь  свою  память и я, скажем, так и
останусь  в  собственном  детстве,  в Палермо, Адроге или Монтевидео?  Зачем
всегда цепляться за прошлое? По-моему, это литературщина. Я могу все  забыть
и остаться собой,  и все это будет жить во мне, даже безымянное. Может быть,
самое  главное  как раз  то,  что  вспоминаешь  неточно,  как  раз  то,  что
вспоминается безотчетно.
     В  заключение скажу, что  верю в бессмертие, но не индивида, а мира. Мы
бессмертны, были и  будем бессмертными. Исчезает  тело,  но остается память.
Исчезает память, но остаются дела,  труды, поступки,  --  вся  эта  чудесная
частица мирового  целого, о котором мы  так  и не узнаем, и  хорошо, что  не
узнаем.
     5 июня 1978 г


          Хорхе Луис Борхес. Детектив




     Есть  такая  книга -- "Расцвет  Новой Англии", Вана Вика Брукса. Речь в
ней идет о невероятном факте, объяснить который под силу лишь  астрологии: о
соцветии талантов, украсивших  крохотный  клочок Соединенных Штатов в первой
половине XIX века. Не стану скрывать своего расположения к этой New England,
столько  унаследовавшей  от  Old England. Составить  длиннейший список  имен
нетрудно:  в  него  войдут Эмили  Дикинсон, Герман Мелвилл,  Торо,  Эмерсон,
Уильям Джемс, Генри Джеймс и, наконец, Эдгар Аллан По, родившийся в Бостоне,
кажется,  в 1809  году. Все  мои  даты, как вы знаете, ненадежны. Говорить о
детективе -- значит говорить об Эдгаре Аллане По, создателе жанра; но прежде
стоило  бы обсудить небольшую  проблему: а существуют ли вообще литературные
жанры?
     Если помните, Кроче в своей -- замечу, бесподобной -- "Эстетике" пишет:
"Назвать  книгу  романом, аллегорией или трактатом  по эстетике  --  в конце
концов, то же самое, что определить ее по желтой обложке или местонахождению
на третьей полке слева". Иными словами, значимость родового отрицается здесь
во имя  ценности индивидуального. На это можно возразить: даже  если реальны
только  индивиды, всякое суждение  о них есть  обобщение. Включая и  эту мою
мысль, которая обобщает, а потому незаконна.
     Мыслить --  значит возводить к общему. Утверждая, нам  не  обойтись без
помощи  этих  платоновских  архетипов.  Так зачем  же отрицать существование
литературных жанров? От себя добавлю: может быть, жанр связан не  столько  с
самим  текстом, сколько со способом его прочтения. Эстетический факт требует
встречи  текста  с читателем, только так он и  создается. Не будем впадать в
абсурд: книга -- это всего лишь книга, -- она живет, если открыта читателем.
Лишь  тогда  и  возникает  эстетический факт,  отчасти  напоминая  этим  миг
зарождения книги.
     Есть  такой  тип  современного  читателя --  любитель  детективов. Этот
читатель  -- а  он расплодился по всему свету, и  считать его приходится  на
миллионы --  был создан Эдгаром Алланом  По. Рискнем представить  себе,  что
такого  читателя не существует, или еще интереснее --  что  он совершенно не
похож на нас. Скажем,  он может быть персом, малайцем, деревенским  жителем,
несмышленым  ребенком,  чудаком,  которого  убедили,  будто  "Дон  Кихот" --
детективный  роман. Так  вот, представим,  что  этот  воображаемый  персонаж
поглощал только детективы, а  после них принялся за  "Дон Кихота". Что же он
читает?  "В некоем  селе  ламанчском,  которого  название  у меня  нет охоты
припоминать, не так давно  жил-был  один идальго..." Он с первой  минуты  не
верит ни единому слову,  ведь читатель детективов -- человек подозрительный,
он читает с опаской, с особой опаской.
     В   самом  деле:  прочитав  "в  некоем  селе  ламанчском",  он  тут  же
предполагает, что события происходили совсем не в Ламанче. Дальше: "которого
название  у меня  нет охоты припоминать..." Почему  это Сервантес  не  хочет
вспоминать?  Ясно,  потому что он  убийца,  виновный.  И  наконец:  "не  так
давно..." Вряд ли прошлое окажется страшней будущего.
     Детектив вызвал к жизни особый тип читателя. Обсуждая творчество Эдгара
По, про это обычно забывают. А ведь если По создал детектив, то он породил и
тип  читателя  детективов.  Чтобы  разобраться  в  детективном жанре,  нужно
учитывать более общий контекст жизни По'. Мне кажется, По был  замечательным
поэтом-романтиком   во  всем  своем  творчестве,   в  нашей   памяти  о  его
произведениях  и  куда меньше --  в каждой  написанной им странице. Он  куда
значительней в прозе, чем в  стихах.  Что представляет  собой По  как  поэт?
Может быть, прав  Эмерсон, назвавший  его the  jingleman -- звонарь,  мастер
созвучий.  В конце концов, это тот же Теннисон, поэт далеко не первого ряда,
хотя у  обоих есть несколько незабываемых строк. Другое дело -- проза: здесь
По стал прародителем бесчисленных теней. Что же он создал?
     Рискну сказать:  есть два человека, без которых  не было бы современной
литературы. Оба  они  американцы и жили в прошлом веке. Один -- Уолт Уитмен,
давший начало так  называемой  гражданской  поэзии, Неруде и много чему еще,
как хорошему, так и  дурному.  Другой --  Эдгар  Аллан  По,  открывший  путь
символизму Бодлера, который был его учеником и молился ему  ночи напролет. В
нем --  первоначало двух явлений,  которые кажутся далекими, а на самом деле
близки. Одно -- это понимание интеллектуальных истоков литературы, Другое --
жанр детектива. Первое -- идея  литературы как порождения ума, а не  духа --
гораздо  важнее.  Второе --  хоть  и вдохновило  крупных  писателей (скажем,
Стивенсона,    Диккенса,    Честертона,    истинного   наследника   По)   --
малозначительно. Эту разновидность литературы можно считать второсортной, да
она  и  в самом  деле хиреет;  сегодня ее превзошла  или  заместила  научная
фантастика,   среди  вероятных  предков  которой  мы,   впрочем,  опять-таки
обнаруживаем Эдгара По.
     Но  вернемся  к  первому  --  к идее о  том,  что поэзия --  порождение
рассудка. Это противостоит всей предшествующей традиции, которая утверждала,
что  поэзия есть творение духа.  Вспомним  такое поразительное явление,  как
Библия --  набор  текстов, которые  принадлежат  различным авторам и эпохам,
толкуют о  несходных темах,  но близки в одном:  они приписываются незримому
существу,  Святому Духу. Предполагается, что Святой Дух, некое божество  или
беспредельный разум, в разных странах и в разное время диктует разным писцам
разные тексты. Среди них  может быть, например, метафизический диалог (книга
Иова),  историческое повествование  (книги  Царств),  теогония  (Исход)  или
благовествования пророков. Все эти тексты ни в чем не сходны,  но  мы читаем
их так, словно они созданы одним автором.
     Будь  мы  пантеистами,  мы  бы  не  преувеличивали,  как  теперь,  свою
индивидуальность,  а видели  в себе различные органы вечного божества. Стало
быть, Святой Дух сотворил все  книги, он же и читает  их  все, поскольку так
или иначе действует в каждом из нас.
     Но вернемся к нашему предмету. Как известно, Эдгар По прожил незавидную
жизнь. Он умер в сорок лет, став жертвой алкоголя, меланхолии и  невроза. Не
вижу смысла входить в подробности его недугов; достаточно знать, что  По был
несчастен   и  обречен  на  безотрадное  существование.  Пытаясь   от   него
освободиться, он довел до блеска, а может быть и перенапряг, свои умственные
способности.  Он  считал себя  выдающимся,  гениальным поэтом-романтиком,  и
прежде  всего не  в стихах, а в прозе -- например  в повести  "Артур  Гордон
Пим". Имена героя  и автора: первое,  саксонское --  Артур и  Эдгар, второе,
шотландское -- Аллан  и  Гордон, и наконец, Пим и  По --  приравнены  друг к
другу.  Автор ценил в  себе прежде  всего интеллект, и Пим кичится тем,  что
способен мыслить и судить обо всем на свете. По написал
     знаменитое,  всем   известное,  возможно,  даже   чересчур   известное,
поскольку  далеко  не лучшее, стихотворение "Ворон".  Позднее он  выступил в
Бостоне с лекцией, где объясняет, как пришел к теме.
     Начал он с того, что задумался о достоинствах рефрена в поэзии, а затем
стал  размышлять о фонетике английского языка.  Ему пришло в голову, что два
самых запоминающихся и  сильнодействующих звука в  английском  -- это  "о" и
"г".  Отсюда родилось слово "nevermore"  --  "никогда". Вот и  все, что было
вначале. Потом возникла другая задача: мотивировать  появление  этого слова,
поскольку  непонятно, зачем  человеку с  монотонностью повторять "nevermore"
после каждой строфы. Тогда  он решил, что нет  никаких причин ограничиваться
разумными  существами  и можно взять  говорящую птицу. Первая мысль  была  о
попугае,  но  попугай снижал бы поэтическое  достоинство вещи,  а потому  он
подумал о вороне. А может  быть, По только что прочитал  тогда роман  Чарлза
Диккенса  "Барнаби  Радж", где  фигурирует  ворон.  Так  или  иначе,  у него
появился  ворон  по имени "Nevermore", который  без конца повторяет это свое
имя. Вот и все, что было у По вначале.
     Потом он задумался: какое событие можно назвать  самым скорбным,  самым
печальным в жизни?  Вероятно,  смерть  прекрасной  женщины. Кто горше других
оплачет  ее? Конечно,  возлюбленный. И  он подумал о влюбленном,  потерявшем
подругу  по  имени  Леонор,  что  рифмуется  с  "nevermore". Куда  поместить
горюющего  любовника?  И он  подумал:  ворон  --  черный,  где  его  чернота
выделится резче всего? На фоне белого; скажем, мраморного бюста, а кого этот
бюст мог  бы  изображать?  Афину  Палладу,  а где он  мог бы  находиться?  В
библиотеке.   Единство   стихотворения,   пишет  По,   требовало  замкнутого
пространства.
     И тогда он поместил бюст Минервы в библиотеку, где одинокий, окруженный
лишь книгами любовник оплакивает смерть  подруги "so lovesick  more";  затем
появляется  ворон.  Для  чего он  нужен?  Библиотека  --  воплощение  покоя;
необходим контраст, какая-то смута, и на УМ поэту  приходит буря,  непогожая
ночь, из которой возникает ворон.
     Герой спрашивает его, кто он такой, ворон отвечает "nevermore", и тогда
влюбленный,  по-мазохистски  разжигая  свою  муку,  бросает  ему  вопрос  за
вопросом, ответ на которые -- один: "nevermore", "nevermore", "nevermore" --
"никогда", а он все задает и задает вопросы. Наконец  он обращается к ворону
с мольбой,  в которой, видимо, заключена главная метафора  стихотворения: он
умоляет "вырвать клюв из его сердца, а образ умершей -- из этого прибежища",
на что ворон (а он, конечно же, есть попросту воплощение памяти, той памяти,
что,  к  несчастью, не ведает  смерти) отвечает "nevermore". Герой осознает,
что обречен  провести  остаток  жизни,  своей  призрачной  жизни, беседуя  с
вороном, отвечающим одно и  то же "nevermore", и  задавая ему вопросы, ответ
на  которые  заранее известен. Иными словами,  По  хочет  уверить нас, будто
создал   стихотворение   усилием   ума;   но  достаточно   присмотреться   к
доказательствам, чтобы убедиться: они фальшивые.
     По мог бы придумать существо, выходящее за границы разума, используя не
ворона, а, скажем, идиота или алкоголика; стихотворение получилось бы совсем
иным  и,  главное,  куда  менее  объяснимым.  Думаю,  По  преклонялся  перед
возможностями ума: он  изобразил эту  свою страсть в виде персонажа и выбрал
для этого совершенно чужого  нам героя, которого все мы знаем и числим среди
друзей, хотя сам он ни малейших оснований к тому не давал, -- это аристократ
Огюст Дюпен, первый  сыщик  в  истории  мировой  литературы.  Он французский
аристократ, обедневший  французский дворянин,  проживающий вместе с другом в
глухом квартале на окраине Парижа.
     Перед  нами --  одна  из  составляющих  детективной традиции: в  основе
детектива лежит тайна, раскрываемая работой ума, умственным усилием.  Делает
это одаренный особыми способностями  человек, носящий имя Дюпена, а потом --
Шерлока Холмса, а еще позднее -- отца  Брауна и многие другие громкие имена.
Первым из них, образцом,  своего рода архетипом, был  дворянин  Шарль  Огюст
Дюпен, живущий  вместе с другом, который и рассказывает  саму  историю. Этот
ход  тоже вошел в традицию и через много  лет после  смерти  По  был  развит
ирландским  писателем  Конан  Дойлем.   Конан   Дойль  воспользовался  этой,
привлекательной  самой по  себе темой  дружбы между  двумя абсолютно разными
героями, которая, в  каком-то  смысле, продолжает линию Дон Кихота  и Санчо,
хотя дружба  этих двоих отнюдь  не была безоблачной. Позже это стало сюжетом
"Кима"  (дружба  между  ребенком и  индуистским священником) и "Дона Сегундо
Сомбры"  --  отношения между  мальчиком и скототорговцем.  Эта тема --  тема
дружбы  -- не  раз встречается в  аргентинской словесности  --  например  во
многих книгах Гутьерреса.
     Конан  Дойль  придумал  достаточно  недалекого  героя,  чьи  умственные
способности несколько  уступают  читательским,  --  он назвал  его  доктором
Ватсоном; другой герой слегка комичен и вместе с тем внушает уважение -- это
Шерлок  Холмс.  Все  построено на том, что  интеллектуальные  находки Холмса
пересказывает   Батсон,   который  не  перестает  удивляться   и   постоянно
обманывается внешней стороной дела, тогда  как  Шерлок  Холмс вновь  и вновь
выказывает свое превосходство, которым, отмечу, весьма дорожит.
     Все это есть уже в.  том первом детективном рассказе "Убийства на улице
Морг", который  По  написал,  не подозревая, что  создал новый  литературный
жанр.  По  не  хотел,  чтобы детектив  был  жанром реалистическим, он  хотел
сделать  его жанром интеллектуальным,  если  угодно  --  фантастическим;  но
фантастическим  именно в смысле работы интеллекта, а не  просто воображения,
точнее -- ив том и в другом смысле, но прежде всего интеллектуальном.
     Конечно, и преступления, и сыщиков можно было поместить в  Нью-Йорк, но
тогда читатель  стал бы раздумывать, как развивались события  на самом деле,
так ли ведет себя нью-йоркская полиция  или  иначе. По решил, что  ему будет
удобней, а  его  воображению  --  вольней, если  все произойдет в  Париже, в
пустынном   квартале  предместья  Сен-Жермен.  Поэтому   первым  сыщиком   в
художественной литературе стал  иностранец, первый описанный в беллетристике
сыщик-француз.  Почему? Потому что описывает  все  случившееся американец, и
ему нужен  непривычный герой. Чтобы  сделать персонажей еще более странными,
он  заставляет их  жить  иначе,  нежели  принято  среди нормальных людей.  С
рассветом они  опускают  шторы и зажигают свечи,  а ночью выходят бродить по
пустынным парижским  улочкам в поисках  той "бездонной  лазури", которую, по
словам По, можно найти лишь в уснувшем громадном городе; ощущение многолюдия
и одиночества разом будит работу мысли.
     Я мысленно представляю двух друзей, бредущих по безлюдным улицам Парижа
и  разговаривающих --  о  чем? О философии, об  интеллектуальных  проблемах.
Потом перед нами преступление, первое преступление в
     фантастической  литературе --  убийство  двух  женщин.  Я  предпочел бы
говорить  о  преступлении,  это звучит сильнее,  чем просто убийство. А речь
именно  о нем: две женщины убиты в своем  жилище, которое кажется  абсолютно
недоступным. По ставит  нас перед загадкой  запертой  комнаты. Одна из жертв
задушена, другая обезглавлена.  Много денег, сорок тысяч  франков, рассыпаны
по полу, вообще все перевернуто вверх дном и наводит на мысль о сумасшедшем.
Иначе говоря, вначале перед  нами  -- зверское и леденящее  кровь событие, и
лишь потом, в финале, дается разгадка.
     Но в ней уже нет  надобности: мы знаем суть, еще не дочитав рассказа. И
это  снижает  его эффект. (То  же самое -- с "Доктором Джекилом  и  мистером
Хайдом": мы знаем, что оба  составляют одно, хотя знать это полагается  лишь
тем,  кто уже прочитал Стивенсона,  другого наследника По. Если говорится  о
странном  происшествии  с доктором  Джекилом  и мистером Хайдом,  то  первой
приходит мысль о двух  разных людях.) Кто,  в  самом деле, мог предположить,
что преступником в конце концов окажется орангутанг, обезьяна?
     Эта  развязка искусно подготовлена:  мы читаем  свидетельства тех,  кто
входил в дом перед  тем, как преступление обнаружилось. Все они слышали один
хриплый голос, принадлежавший французу, разбирали отдельные  слова и слышали
другой голос,  не  понимая  ни единого слова,  -- голос иностранца.  Испанцу
кажется, что это был немец, немцу -- голландец, голландцу -- итальянец и так
далее;  а  это  нечеловеческий  голос  обезьяны,  он   и   служит  разгадкой
преступления, которую мы, впрочем, уже знаем.
     Может быть, поэтому  мы не слишком  высоко ставим По, считая его сюжеты
настолько   тонкими,   что,   пожалуй,   почти   прозрачными.   Такими   они
представляются,  поскольку  мы  уже   знаем  их,  но  для  первых  читателей
детективных  историй все выглядело иначе: им недоставало нашей изощренности,
ведь По еще не изобрел их, как всех нас. Мы, читатели детективов, изобретены
Эдгаром Алланом По. Те, кто читал эти вещи первыми, были зачарованы ими, мы,
другие, пришли поздней.
     По оставил пять образчиков детективного  жанра. Один называется "Ты еси
муж":  он  самый слабый,  но позже  ему  подражал  Исраэль Зангвилл в романе
"Убийство   в  Биг  Боу",  где  преступление  тоже  совершают   в   запертом
пространстве. Есть  там  и  персонаж  убийцы, которого  воспроизвел потом  в
"Тайне  желтой комнаты"  Гастон Леру: убийцей в этом случае оказывается  сам
сыщик. Другой -- и, напротив, мастерский -- рассказ  называется  "Похищенное
письмо", еще один -- "Золотой жук". Сюжет "Похищенного письма" крайне прост.
Неким литератором украдено письмо,  и полиция  знает, что оно -- у него. Его
дважды обыскивают на улице. Потом рыщут в доме; чтобы ни  малейшая мелочь не
ускользнула,  дом  поделен  и  подразделен  на  участки, полиция  пользуется
микроскопами  и  лупами. Обследуют  каждую книгу  в библиотеке, смотрят,  не
сменен ли ее переплет,  проверяют полоски  пыли,  набившейся между  половиц.
Потом в  расследование включается Дюпен.  Он  уверен, что  полиция  идет  по
ложному пути, что ее идея, будто прятать можно лишь в тайниках, -- на уровне
ребенка, а их случай отнюдь  не из детских.  Дюпен  по-приятельски  навещает
подозреваемого  и  обнаруживает у  него  на  столе, у  всех  на виду, рваный
конверт.  Он догадывается,  что это  и есть письмо,  которое все ищут  сломя
голову. Идея состоит  в том, чтобы  спрятать вещь у всех на  виду: пусть она
будет  настолько очевидна, что  никому не заметна.  Чтобы показать, с  каким
интеллектуальным искусством трактует  По  детективные сюжеты, каждый рассказ
начинается  дискуссией  об  аналитических   способностях,  скажем  спором  о
шахматах, где среди прочего обсуждают, что сложней -- вист или шашки.
     Кроме этих четырех новелл По оставил еще одну -- "Тайна Мари Роже", она
самая загадочная, но  читается  с наименьшим интересом.  Речь  в ней идет  о
преступлении  в  Нью-Йорке,  где  была убита  девушка по имени  Мэри Роджер,
кажется,  цветочница.  Сюжет По взял  попросту  из  газет.  Он перенес место
действия в Париж, переименовал  героиню в  Мари  Роже и представил себе, как
могло  быть совершено преступление.  Подлинный виновник через несколько  лет
отыскался и признал, что все происходило именно так, как написано у По.
     Тем самым  детективная история получила статус интеллектуального жанра.
Поскольку этот  род искусства  основывается на полном вымысле,  преступление
здесь  тоже раскрывается благодаря работе  отвлеченного ума, а не доносу или
промаху  преступника. По  ясно  понимал,  что  изобретенное  им не имеет  ни
малейшего отношения к реальности, почему и перенес место действия в Париж, а
сыщиком сделал аристократа, но не полицию,  над которой  герой подтрунивает.
Иными  словами, По  создал мастера мысли. Что последовало  за смертью По? Он
умер, кажется, в 1849 году. Его великий современник Уолт Уитмен отозвался на
эту смерть некрологом, где  сказал, что По "был исполнителем, умевшим играть
лишь на басах и понятия не  имевшим об американской демократии", --предмете,
о  котором По и не помышлял высказываться. Уитмен был  к нему  несправедлив,
как и Эмерсон.
     Нынешние критики, напротив, склонны его переоценивать. Я же считаю, что
творчество  По   как  целое  отмечено  гениальностью,  хотя  проза  его,  за
исключением повести  "Артур  Гордон Пим", далека от  совершенства. И тем  не
менее из всех его  рассказов складывается один  обобщенный персонаж, который
переживает  все им  созданное -- и Шарля Огюста  Дюпена, и  преступления,  и
тайны, которые уже никого не пугают.
     В Англии, где детективный жанр разрабатывается в психологическом ключе,
написаны лучшие из существующих детективов: они принадлежат  Уилки Коллинзу,
это  его  романы  "Женщина в белом"  и "Лунный камень". Позже -- Честертону,
великому  наследнику По. Честертон  сказал бы, что  детективные  новеллы  По
превзойти  невозможно,  но,  на  мой  вкус, Честертон выше. По  писал  чисто
фантастические рассказы. Вспомним "Маску красной смерти", вспомним  "Бочонок
амонтильядо"  -- это же чисто фантастические  вещи. Кроме того, у него  были
интеллектуальные  рассказы,  вроде  тех  пяти,  о  которых  уже  говорилось.
Честертон  делал  совершенно  другое:  он  писал  фантастические  новеллы  с
детективной    разгадкой.    Перескажу   одну   из   них,   она   называется
"Человек-невидимка" и опубликована в 1905 или 1908 году.
     Содержание,  в  двух  словах, таково.  Речь  идет  о  мастере, делающем
механические игрушки --  поваров,  привратников,  слуг, рабочих; он живет  в
многоквартирном  доме  на  вершине  заснеженного  лондонского  холма.  Герой
получает  письма  с угрозами,  что его убьют  -- а  сам он  существо  совсем
малорослое,  это  крайне  важно для  рассказа. Живет  он  наедине  со  своей
механической прислугой, что уже  внушает ужас. Человек, живущий  одиночкой в
окружении машин, напоминающих призраки человека. Наконец он получает письмо,
из  которого следует,  что его  убьют  нынче  вечером.  Он  зовет на  помощь
приятелей, те отправляются за полицией, оставляя его наедине с игрушками, но
прежде наказав привратнику следить за  всеми, кто входит  в дом. То же самое
они поручают полисмену, а кроме того --  торговцу жареными  каштанами.  Трое
обещают  сделать  все, что от  них зависит.  Когда  приятели  возвращаются с
отрядом полиции, они замечают следы на снегу. Те, что ведут к  дому, слабее,
те же,  что от  дома, -- глубже, как  будто  идущий нес что-то тяжелое.  Все
входят в дом и видят, что кукольник исчез. Кроме того, в камине обнаруживают
пепел. Это  самое сильное место в рассказе: растет подозрение,  что человека
уничтожили его механические  игрушки, и это впечатляет. Впечатляет  сильней,
чем сама разгадка. На самом деле, убийца проник  в дом, и продавец каштанов,
полицейский  и привратник видели,  но не  заметили  его,  поскольку  это был
почтальон, каждый вечер приходивший в одно  и  то же время. Он убил жертву и
спрятал труп в сумку для писем, а письма сжег, после чего  покинул дом. Отец
Браун встретился с  ним, допросил убийцу,  выслушал его признание и отпустил
виновного, потому что  в рассказах  Честертона не  бывает  арестов  и вообще
никакого насилия.
     Сегодня  детективный жанр переживает в  Соединенных Штатах  упадок.  Он
стал реалистическим и  рассказывает о насилии, включая сексуальную агрессию.
Так  или иначе, жанр  умирает.  Интеллектуальные  истоки  детектива  забыты.
Кое-как они еще  удерживаются в  Англии, где до  сих  пор  пишут безмятежные
романы, действие которых разворачивается в английской  деревушке; в  них все
расчислено,  все  безмятежно  и  не  угрожает  ни  насилием,  ни  чрезмерным
кровопролитием. Я тоже несколько раз пробовал написать детективную историю и
не слишком горжусь  тем, что получилось. Я перенес место действия в  область
символического  и не  знаю, насколько  это  подходит детективу. Так  написан
рассказ  "Смерть  и буссоль". Несколько  детективов я писал в  соавторстве с
Бьоем Касаресом, чьи новеллы вообще  лучше моих. Вместе мы написали рассказы
о доне Исидро Пароди, который сидит в  тюрьме и разгадывает преступления  из
тюремной камеры.
     Что  можно сказать  во славу  детективного  жанра?  Трезво и  уверенно,
пожалуй,  одно:  наша  литература  движется  к  хаосу.   Поэзия  клонится  к
свободному стиху, полагая, что тот легче регулярного; на самом  деле он куда
трудней. Упраздняются герои, сюжет, все тонет в
     неразличимости.  В  это  столь  хаотическое время есть  скромный  жанр,
который  пытается  сохранить  классические  достоинства,  и   этот  жанр  --
детектив.  Речь не о  тех  детективах без  завязки, кульминации  и развязки,
которые пишут второразрядные авторы. Я говорю о детективах,  вышедших из-под
пера  писателей первого ранга:  Диккенса, Стивенсона и  прежде  всего  Уилки
Коллинза.  В защиту  детективного жанра я бы сказал,  что он  не нуждается в
защите: читаемый сегодня с чувством  превосходства, он  сохраняет порядок  в
эпоху  беспорядка.  Такая  верность   образцу  достойна  похвалы,  и  вполне
заслуженной.
     16 июня 1978 г


          Хорхе Луис Борхес. Книга





     Среди   различных   орудий,   которыми   располагает   человек,   самым
удивительным,  несомненно, является книга. Все остальное  можно считать  его
физическим продолжением. Микроскоп и телескоп -- продолжают глаз, телефон --
голос,  плуг и  шпага  -- руки.  Но книга --  совсем другое  дело,  книга --
продолжение памяти и воображения.
     Когда у  Шоу  в  "Цезаре и Клеопатре"  заходит речь  об Александрийской
библиотеке, ее  называют памятью человечества. Да, книга --  наша память. Но
одновременно  в ней есть и нечто большее, она -- воображение. Ибо что  такое
наше прошлое, как не череда сновидений? И чем отличается воспоминание о снах
от воспоминания о прошлом? И память, и воображение -- все есть в книге.
     Когда-то я думал  написать историю  книги. Но не  с материальной  точки
зрения.  Книги не  интересуют  меня как физические объекты (в первую очередь
это  относится  к   книгам  библиофилов,  собираемым   обычно   в   огромных
количествах), меня  интересуют  мнения, высказанные о  книгах.  Об  этом уже
писал Шпенглер  в  "Закате Европы", там есть прекрасные  страницы о книге. К
тому,  о  чем  говорит  Шпенглер, я  хотел  бы присовокупить  некоторые свои
соображения. Древние греки и  римляне  не исповедовали  наш культ книги -- и
это меня удивляет. В книге они видели суррогат устного слова. Фраза, которую
обычно  цитируют: "Scripta manent, verba volant" (Написанное остается, слова
улетают  (лат.)  означает  не  то, что  устное  слово  эфемерно,  а то,  что
написанное слово  жестко и мертво. В устном же  слове есть что-то крылатое и
легкое -- "крылатое и  священное", как  говорил  Платон. Все великие учители
человечества наставляли устным словом.
     Возьмем первый  пример: Пифагор. Нам известно,  что  Пифагор  намеренно
ничего не писал. Не писал,  потому что  не хотел связывать  себя  написанным
словом. Безусловно,  он чувствовал, что буква убивает,  а дух  оживляет, как
будет сказано потом в Библии. Он должен был очувствовать это, когда не хотел
связывать себя  написанным словом. Поэтому  Аристотель всегда говорит  не  о
Пифагоре, а о  пифагорейцах. К примеру,  он пишет,  что пифагорейцы верили в
догмат вечного возвращения -- много позднее его откроет Ницше. Это та  самая
идея циклического времени,  которая  была опровергнута Святым  Августином  в
"Граде Божием".  Святой Августин, используя прекрасную метафору, утверждает,
что  крест  Христа  избавил  нас  от циклического  лабиринта  стоиков.  Идея
цикличности искоренялась также Юмом, Бланки и многими другими.
     Пифагор  не  писал специально;  он хотел, чтобы  его мысль пережила его
физическую  смерть в сознании учеников. Отсюда и пошло выражение (я  не знаю
греческого, поэтому  скажу на латыни):  "Magister dixit" ("Учитель сказал").
Оно не означает, что ученики оказываются связанными тем, что сказал учитель;
наоборот, оно  утверждает свободу следовать в рассуждениях изначальной мысли
учителя.
     Неизвестно,  сам  ли   Пифагор  положил  начало  доктрине  циклического
времени, но  мы  знаем, что  ее исповедовали его последователи. Пифагор умер
физически, но ученики, словно в результате переселения душ --  Пифагору  это
понравилось бы, -- вновь и вновь следовали его мыслям, а когда их упрекали в
том, что они говорят что-то новое, они опровергали обвинение фразой: учитель
сказал -- "Magister dixit".
     Но есть и другие примеры.  Таков высокий пример Платона, утверждавшего,
что книги подобны образам  (должно  быть, он имел  в виду статуи и картины),
которые кажутся живыми,  но не ответят  нам,  если мы их  о чем-то  спросим.
Чтобы исправить этот недостаток, Платон придумал  диалог. В диалогах  Платон
реализуется во  множестве персонажей:  в  Сократе, Горгии и других. Возможно
также, что  после  смерти  Сократа Платон хотел  утешить себя мыслью,  будто
Сократ продолжает жить. Сталкиваясь с любой проблемой, он спрашивает себя: а
что сказал бы об этом Сократ? Так осуществилось бессмертие  Сократа, который
наставлял устным словом и ничего не писал.
     Известно,  что  Христос  лишь  однажды  написал несколько слов.  Но  он
написал их на песке,  и они исчезли.  Нам неизвестно, писал ли он что-нибудь
еще.  Будда  также  учил  устным словом;  сохранились  его проповеди.  Можно
вспомнить высказывание Святого Ансельма:  "Вкладывать  книгу в руки  невежды
так же опасно, как вкладывать меч в руки ребенка". Так он думал о книгах. На
Востоке до  сих пор  существует представление  о том,  что  книга  не должна
раскрывать суть вещей, книга должна  только  направлять нас. Несмотря на мое
незнание  еврейского  языка,  я  немного  занимался   каббалой  и  прочел  в
английском  и немецком переводах  "Зогар" ("Книга сияния") и "Сефер  Йецира"
("Книга  творения"). Эти книги были написаны не для того, чтобы их понимали,
а чтобы их интерпретировали, чтобы читатель продолжал размышлять. Античность
не имела нашего почтения к книге, хотя, как известно,  Александр Македонский
клал под подушку два вида оружия:  "Илиаду" и меч. Гомера почитали, но в нем
не видели непререкаемого авторитета. "Илиада" и "Одиссея" не были священными
текстами.  Эти  книги  очень  высоко  ценили,  но   их   вполне  можно  было
критиковать.
     Платон  мог  изгнать  поэтов  из  своей  республики,  не подвергнувшись
обвинению в их оскорблении. Ко всему сказанному добавлю еще очень интересное
место  из  Сенеки.  В  прекрасных  "Письмах  к  Луцилию"  имеется  послание,
направленное  против  одного тщеславного человека, у  которого, как сообщает
Сенека,  есть библиотека  в  сто  томов. Но у кого  же,  спрашивает  Сенека,
найдется время, чтобы прочесть  сто томов? Зато  сейчас,  наоборот,  ценятся
обширные библиотеки.
     Итак, нам следует знать, что отношение к книге в античности  не походит
на наш культ книги. В книге  видели лишь суррогат  устного слова. Но затем с
Востока  пришла  новая  концепция,  во  всем  чуждая  античности:  концепция
священной  книги.  Рассмотрим  два  примера,   начав  с  более  позднего:  с
мусульман.  Мусульмане  считали,  что Коран предшествует миру,  предшествует
арабскому языку. Коран --  не  творение Бога, он, подобно Божьему милосердию
или Божьему правосудию,  атрибут Бога. В самом Коране в довольно мистической
форме говорится  о  "матери книги". "Мать  книги"  -- это  оригинал  Корана,
начертанный  на  небе,  что-то  вроде  платоновской идеи  Корана.  Итак, как
говорится в Коране, "мать книги" написана на небе, является атрибутом Бога и
предшествует миру. Так провозглашают мусульманские ученые.
     Возьмем  более   близкий  нам  пример:  Библия,  конкретнее  Тора,  или
Пятикнижие.  Считается, что эти  книги были  продиктованы  Святым Духом. Это
любопытно: утверждать, что книги разных авторов и разного времени  написания
проникнуты одним-единственным духом. Впрочем, в самой  Библии говорится, что
Дух проникает  повсюду. Евреи сочли возможным объединить разные произведения
литературы разных  эпох и  образовать  из них  одну книгу,  название которой
Танах (Библия  по-гречески).  Все  произведения  в  ней  приписывают  одному
автору: Духу.
     Бернарда Шоу однажды спросили, считает ли  он,  что  Дух Святой написал
Библию.  И  Шоу  ответил:  "Всякая  книга,  которая  стоит  того,  чтобы  ее
перечитывали,  создана Духом".  То есть книга должна  идти  дальше, чем того
хочет  автор.  Цель автора  --- всего  лишь  человеческая  цель, автор может
ошибаться,  но  в книге должно быть  что-то большее. Так, "Дон Кихот"  -- не
просто сатира на рыцарские романы. Это абсолютный текст, в котором нет места
случайности.
     Подумаем о следствиях из этой идеи. Например, если я говорю:
     Воды  быстрые,  чистые,  хрустальные.  Деревья, на которые мы  смотрим.
Зеленый луг, прохладной тени полный,
     очевидно,  что  каждая  испанская строка  состоит здесь из  одиннадцати
слогов. Так сознательно хотел автор.
     Но что это в сравнении с произведением, созданным Духом, что есть это в
сравнении с идеей Божества, снисходящего к литературе и  диктующего книгу! В
этой книге нет места случайному,  все должно  быть оправданным,  даже буквы.
Известно, например, что в начале Библии  -- "Берешит  бара Элоким"  (Вначале
сотворил Бог  (ивр.) )  --  стоит  буква  "б", потому  что с  этой  же буквы
начинается  глагол "благословлять".  В одной из книг  Библии говорится,  что
ничто, абсолютно ничто не  случайно. Это приводит  нас к каббале, приводит к
изучению  букв,  к  идее  Священной  Книги,  продиктованной  Божеством.  Это
противоположно  взглядам  древних  греков  и римлян. Они достаточно свободно
думали о музе.
     "Гнев, о  богиня, воспой Ахиллеса,  Пелеева  сына",  -- говорит Гомер в
начале "Илиады". Муза связывается здесь  с вдохновением. Напротив,  если  мы
думаем о Духе, то имеем в виду что-то более конкретное, более сильное: Бога,
Который  снисходит  к  литературе. Бога,  Который пишет книгу.  В этой книге
ничто не  случайно: ни порядок букв, ни количество слогов в каждом стихе, ни
возможные огласовки, ни числовые значения букв. Все это уже изучалось.
     Итак, вторая великая концепция книги заключается в том, что книга может
быть Божественным произведением.  Возможно, эта концепция ближе тому, что мы
чувствуем  сейчас, чем  взгляды  античности,  то  есть  идея  о  совершенном
суррогате устного слова. Затем вера в священную книгу теряется  и заменяется
другими верованиями. Отсюда, например, идет представление  о том, что каждый
народ, каждая страна представлены книгой. Вспомним,  что мусульмане называют
Израиль "народом  книги",  вспомним фразу  Генриха  Гейне  о  нации,  родина
которой -- книга: Библия, евреи.  Появляется новая теория, согласно  которой
каждая страна должна быть представлена книгой или несколькими книгами одного
автора.
     Интересно  --  мне  кажется,  это еще  не  было замечено, -- что страна
выбирает для  себя писателя, ей абсолютно  не  близкого. Так, кто-то думает,
что  Англия должна бы избрать своим представителем доктора Джонсона, но нет,
Англия  выбрала Шекспира, который  является -- скажем  это так -- наименьшим
англичанином   из   всех   английских   писателей.   Для    Англии   типично
"understatement" (Сдержанное  высказывание, преуменьшение  (англ.),  то есть
говорить обо всем недомолвками. Шекспир же тяготеет к гиперболе, метафоре, и
нас  нисколько не  удивило бы, если б Шекспир оказался, например, итальянцем
или евреем.
     Другой  пример  --  Германия.  Эта  замечательная страна,  столь  легко
становящаяся фанатичной, выбирает  своим  представителем человека терпимого,
не фанатика,  человека,  которого не  очень-то волнует идея родины. Германия
выбирает Гете. Германию представляет Гете.
     Франция не  выбрала  своего  писателя,  но она склонна остановиться  на
Гюго.  Я, разумеется, восхищаюсь Гюго, но Гюго --  не типичный француз, Гюго
-- иностранец во Франции. С  его  антуражем,  пространными метафорами, он не
типичен для Франции.
     Еще более  любопытный  пример -- Испания. Она  могла  быть представлена
Лопе,   Кальдероном,   Кеведо.  Так  нет.  Испанию  представляет  Мигель  де
Сервантес. Сервантес  -- современник инквизиции,  но он человек терпимый,  у
него нет ни добродетелей, ни пороков испанцев.
     Каждая  страна  словно  бы  решила, что она  должна  быть  представлена
писателем,  чужим для  нее, который  сможет  помочь  ей,  найдет  лекарство,
противоядие от ее недостатков. Мы могли бы выбрать  "Факундо"  Сармьенто, но
нас,  с нашей  военной  историей --  историей  клинка, представляет  хроника
дезертирства: "Мартин Фьер-ро".  И  если  просто  как книга  "Мартин Фьерро"
заслуживает этого избрания, каково нам думать, что наша история представлена
дезертирством? Однако каждая страна словно чувствует такую необходимость.
     О книге блестяще  говорили многие писатели. Я хочу сказать о некоторых.
Во-первых, я скажу о Монтене, который одно из своих эссе посвятил книге. Там
есть  запоминающаяся  фраза:  "Я  не  делаю  ничего  без  радости".  Монтень
замечает, что теория принудительного  чтения -- неправильна. Он говорит, что
если находит трудное  место в книге,  то пропускает его, потому что видит  в
чтении  род счастья. Вспоминаю,  как много лет назад проводился опрос о том,
что такое живопись. Спросили мою  сестру Нору, и она  ответила, что живопись
--  это  искусство приносить  радость  цветами и  красками. Я бы сказал, что
литература тоже должна приносить радость. Если мы читаем что-либо с  трудом,
значит, автор  потерпел  неудачу.  Поэтому  я думаю, что такой писатель, как
Джойс, в сущности, потерпел неудачу, -- ведь его книги читаются с трудом.
     Нельзя  читать  книгу с напряжением. Чтение -- это  счастье. Думаю, что
Монтень прав. Затем Монтень  перечисляет  авторов, которые ему нравятся.  Он
обращается  к  Вергилию и говорит, что  "Энеиде" предпочитает  "Георгики"; я
предпочитаю  "Энеиду", но это не стоит  рассмотрения. Монтень пишет о книгах
со страстью, но считает, что, хотя чтение и есть род счастья,  книги  все же
изнурительное удовольствие.
     Эмерсон  не соглашается  с  ним -- вот  еще одно великое произведение о
книгах. В  своей лекции Эмерсон говорит, что библиотека -- это  что-то вроде
магического кабинета. Там заколдованы лучшие души человечества,
     но они ожидают нашего слова, чтобы выйти из  немоты.  Мы должны открыть
книгу,  и тогда  они  очнутся.  Эмерсон  полагает, что  мы можем общаться  с
лучшими  умами  мировой  истории, но  не  стремимся к этому, мы предпочитаем
критические комментарии самим авторам.
     Я  в  течение  двадцати  лет был  профессором  английской литературы на
факультете  философии и  литературы Университета в Буэнос-Айресе.  Я  всегда
говорил  своим студентам, чтобы их библиографии  были  небольшими, чтобы они
читали  не критику,  а сами  книги. Возможно, они не  все  поймут, но всегда
будут  радоваться и слушать чей-то подлинный голос. Я сказал бы, что  важнее
всего в писателе  -- его интонация,  важнее всего  в книге -- голос  автора,
доходящий до нас.
     Я посвятил часть своей жизни литературе и  думаю,  что чтение  приносит
нам счастье. Меньшее счастье дарует нам поэтическое  творчество, или то, что
мы называем творчеством; на самом деле оно представляет собой смесь забвения
и воспоминаний о том, что мы прочитали.
     Эмерсон сходится с Монтенем,  утверждая: следует читать только  то, что
нам  нравится,  книга  должна  приносить  счастье.  Мы столь  многим обязаны
литературе. Я  всегда старался больше перечитывать, чем читать. Мне кажется,
перечитывать  важнее.   Прежде   необходимо  прочитать  книгу,  а  уж  затем
перечитывать.  Я  исповедую  культ  книги.  Может быть, мои слова  покажутся
патетичными,  но  я не хочу, чтобы они  звучали патетично, я хочу, чтобы они
были признанием каждому  из  вас, не всем, но каждому, потому что все -- это
абстракция, а каждый -- реальность.
     Я продолжаю играть в то, что я не слепой, я продолжаю покупать книги, я
наполняю  ими свой дом. Как-то  мне  подарили энциклопедию Брокгауза издания
1966  года,  и я  ощутил присутствие  этой книги в моем доме, я почувствовал
себя  счастливым. В  энциклопедии было двадцать с чем-то томов, напечатанных
готическим  шрифтом, карты и гравюры. Я не могу читать, потому что ничего не
вижу.  Однако  энциклопедия  была рядом со  мной. Я  чувствовал ее дружеское
напряжение. Думаю, что книга -- это надежда обрести счастье.
     Говорят об исчезновении  книги;  я считаю, что это невозможно.  Скажут:
какая разница между книгой  и газетой, книгой и пластинкой?  Разница в  том,
что газету мы читаем, чтобы забыть, пластинку мы слушаем
     также, чтобы  забыть. В них есть что-то механическое  и легкомысленное.
Книга читается, чтобы ее помнить.
     Теория  священной  книги,  Корана,  или  Библии,  или  Вед  (там  также
говорится,  что  Веды  сотворили  мир),  может  уйти  в  прошлое, но  книга,
несомненно,  еще  имеет  для нас  некоторую  святость, которую  мы не должны
терять.  Просто  взять  книгу в руки,  открыть  ее  --  это уже эстетическое
наслаждение.  Что такое  слова,  составляющие книгу?  Что такое эти  мертвые
символы? Абсолютно ничего.  Что такое книга,  если  ее  не открывать? Просто
параллелепипед из кожи и  бумаги. Но  если ее  читать,  то происходит  нечто
странное -- она всякий раз иная.
     Гераклит сказал (я не раз  повторял это изречение), что никто не войдет
дважды  в одну и ту  же реку.  Никто не войдет дважды в  одну и ту же  реку,
потому  что воды текут, но самое ужасное в том,  что мы не менее текучи, чем
вода. Каждый  раз,  когда мы читаем книгу,  она меняется,  слова приобретают
иную коннотацию. Кроме того, книги обременены прошлым.
     Я  выступал против критики, а теперь  откажусь от своих слов. Гамлет --
это  не  только такой  Гамлет, каким его видел  Шекспир в начале XVII  века.
Гамлет -- это Гамлет  Колриджа, Гете и Брэдли.  Гамлет был  возрожден. То же
происходит с "Дон Кихотом". То  же  -- с  Лугонесом  и Мартинесом  Эстрадой.
"Мартин Фьерро" не остался неизменным. Читатели обогащают книгу.
     Когда читаешь  старую книгу, кажется, будто бы читал ее всегда, со  дня
написания. Поэтому  надо поддерживать культ книги. В  книге может быть полно
опечаток, мы  можем не соглашаться с  авторскими  суждениями,  но  в ней все
равно остается что-то священное, божественное, к  чему мы должны  относиться
не с суеверным почтением, а с желанием обрести счастье и мудрость.
     Вот что я хотел вам сказать сегодня


          Хорхе Луис Борхес. Время




     Ницше не любил, когда ставили рядом имена  Гете и Шиллера. Добавим, что
столь же непочтительно объединять пространство и время,  тем  более  что  мы
можем абстрагироваться лишь от пространства, но не от
     времени.
     Предположим,  что  вместо пяти чувств  у  нас есть лишь одно. Пусть это
будет  слух.  Тогда  исчезнет зрительный  мир,  то  есть  исчезнут небосвод,
звезды...  Так  как  мы  лишимся  осязания,   исчезнет  неровное,   гладкое,
шероховатое. Если мы потеряем также обоняние и вкус, пропадут локализованные
в  языке  и  в  носу  ощущения.  Останется  только слух.  Тогда  перед  нами
предстанет  мир без пространства. Мир  индивидуальностей. Индивидуальностей,
которые могут  общаться друг с  другом.  Может  быть, их тысячи, может быть,
миллионы, и общаются они посредством  слов (ничто не мешает им выдумать язык
такой же сложный,  как наш, или еще сложнее) и посредством музыки. Это будет
мир,  в котором  существуют лишь отдельные сознания  и музыка. Заметим, что,
хотя для музыки нужны музыкальные инструменты, это не значит,  что  без  них
музыка  невозможна.  Инструменты  необходимы  лишь  для  исполнения  музыки.
Вспомним  какую-нибудь  партитуру. Мы  можем  представить  ее  звучание  без
инструментов, без пианино, скрипок, флейт...
     И этот мир,  состоящий из индивидуальностей и музыки, не беднее нашего.
Как сказал  Шопенгауэр,  музыка  не  является чем-то  внешним по отношению к
миру, музыка и есть  мир.  В этом мире у  нас всегда будет время. Потому что
время  --  это  последовательность. Пусть каждый из  нас  представит, что он
очутился  в  темной комнате. Тогда исчезнет видимый мир,  исчезнет тело. Как
часто  мы  не  чувствуем  своего  тела!  Например,  сейчас,  только  сейчас,
дотронувшись до стола  рукой,  я  ощутил  стол  и  руку.  Но  что-то  должно
происходить.  Что?  Быть  может, наши  восприятия, ощущения  или  же  просто
воспоминания и представления.  Но все  время что-то  происходит. Я вспоминаю
прекрасную строчку Теннисона  в одном из ранних его стихов: "Time is flowing
in the middle of the night" ("время, струящееся в
     полночь"). Какой поэтический образ: весь  мир  спит,  но бесшумная река
времени   (эта  метафора  неизбежна)  струится  по  земле,   под  землей,  в
межзвездном пространстве.
     Таким  образом,  время представляет собой сущностную  проблему. Этим  я
хочу  сказать,  что  от  времени мы не можем абстрагироваться. Наше сознание
постоянно  переходит от одного  состояния  к другому,  а  это и есть  время:
последовательность. Кажется, Анри Бергсон сказал, что время является главной
проблемой  метафизики. Разрешив эту  проблему, мы разрешили бы все  загадки,
но,  к счастью, это нам не грозит. Мы вечно будем жаждать решения. Мы всегда
сможем вслед за  Святым Августином сказать: "Что такое  время?  Пока меня не
спрашивают, я это знаю. А если спросят, я теряюсь".
     Не знаю,  насколько  мы  продвинулись  в решении  проблемы  времени  за
двадцать--тридцать  веков размышлений.  Но мы и поныне  ощущаем  то  древнее
смущение, которое когда-то поразило Гераклита. Я снова и снова возвращаюсь к
его  изречению:  никто не войдет дважды в одну и  ту же  реку.  Почему никто
никогда  не войдет дважды в одну и ту же  реку? Во-первых,  потому что  воды
реки  текучи. Во-вторых  -- и это  метафизически затрагивает  нас, пробуждая
что-то вроде священного ужаса, -- потому что мы сами подобны реке, мы  также
текучи.
     В  этом  и  состоит  проблема  времени. Это  проблема текучести:  время
проходит.  Я вспоминаю  прекрасный  стих Буало: время проходит в тот момент,
когда  что-то уже  далеко от меня.  Мое  настоящее  -- или то, что было моим
настоящим,  --  уже  стало прошлым, но проходящее время не проходит всецело.
Например, мы  с  вами  беседовали  в прошлый четверг. Можно  сказать, что мы
стали другими;  ведь за  неделю  с  нами произошло много  разных событий. Но
все-таки мы те же. Я знаю, что я выступал здесь, что я пытался рассуждать, а
вы, наверное, помните,  как  вы слушали  меня на прошлой  неделе.  Во всяком
случае, это остается в памяти. Память индивидуальна. Мы во многом состоим из
нашей памяти.
     А память в значительной степени состоит из забвения.
     Итак, мы поставили проблему времени. Возможно,  мы  сейчас не  решим ее
для  себя, но мы можем сравнить предлагавшиеся решения. Самое древнее из них
принадлежит Платону, у  которого  его заимствовал  Плотин, а  затем и Святой
Августин.  Эта  идея  --  одно из  самых прекрасных изобретений  человека. Я
полагаю именно человека, но, если  вы  религиозны, вы, должно  быть, думаете
иначе. Это  прекрасное изобретение -- вечность. Что такое вечность? Вечность
-- не сумма всех наших вчера. Вечность -- это все наши вчера, все вчера всех
разумных  существ.  Все прошлое, все неизвестно когда начавшееся  прошлое. И
настоящее.  Мгновение,  охватывающее  все  города,  все  миры,  межпланетное
пространство. И наконец, будущее. Еще не  сотворенное,  но тоже существующее
во времени.
     Теологи  считают  вечность  мгновением,  в   котором  чудесным  образом
объединены  эти  разные  времена.  Воспользуемся  словами  Плотина,  глубоко
прочувствовавшего проблему времени. Плотин говорит: существуют три  времени,
и все три -- настоящее. Одно -- непосредственное настоящее, мгновение, когда
я  говорю.  То  есть мгновение,  когда  я  говорил,  ведь  это мгновение уже
относится к прошлому. Другое время  -- настоящее прошедшего, оно  называется
памятью. И  третье --  настоящее будущего, то,  что видится нашим надеждам и
страхам.
     А  теперь перейдем  к  тому решению,  которое  дал  Платон; оно кажется
произвольным, но я надеюсь показать вам, что это не так. Платон говорил, что
время -- текучий образ вечности. Он начинает с вечности, с Вечного Существа,
желающего отразиться  в других  существах. Но  в  вечности  это  невозможно.
Отражение  должно  осуществиться  последовательно. Время становится  текучим
образом вечности. Как сказал великий  английский мистик Уильям Блейк, "время
--  дар  вечности". Если  бы нам было даровано  все  бытие!..  Бытие  больше
вселенной, больше мира. Если бы нам лишь однажды показали все бытие, мы были
бы раздавлены,  сломлены, уничтожены. Мы бы  погибли. Время -- дар вечности.
Вечность позволяет нам  жить в последовательностях. У  нас есть  дни и ночи,
часы и минуты, у нас есть память, есть сиюминутные  ощущения, и, наконец,  у
нас  есть будущее,  будущее, которого мы еще  не знаем, но предчувствуем или
боимся.
     Все это  нам дано в  последовательности,  потому что мы  не вынесли  бы
безмерной  тяжести  совокупного  бытия  вселенной.   Таким   образом,  время
становится  для   нас   даром  вечности.  Вечность  позволяет  нам  жить   в
последовательности.  Шопенгауэр  сказал, что, к  счастью для нас, наша жизнь
делится  на дни  и  ночи, бодрствование  прерывается сном. Утром  мы встаем,
проводим  день, а потом  засыпаем.  Если бы не  было  сна,  жизнь  стала  бы
невыносимой. Мы  не были бы  хозяевами наших  наслаждений. Целостность бытия
для нас невыносима. Поэтому все, что нам предоставляется, дается постепенно.
     Со  схожими идеями  связана концепция  переселения  душ.  Возможно, как
верят пантеисты,  мы  растворены  во  всех минералах,  всех растениях,  всех
животных, всех людях. Но, к счастью, мы этого не знаем. К счастью,  мы верим
в индивидуальности. И если бы мы  не были обмануты, эта цельность  раздавила
бы нас.
     Перейдем  к Святому Августину. Думаю,  никто не прочувствовал  проблему
времени  сильнее,  чем  он.  Святой  Августин говорит, что его  душа  жаждет
узнать, что такое  время. Он просит Бога ответить  ему на этот вопрос. Не из
пустого  любопытства, но потому, что он не может жить  иначе. Это становится
для  него  сущностным вопросом, тем,  что  Бергсон  назовет  потом  основной
проблемой метафизики. Обо всем этом с жаром говорит Святой Августин.
     Рассуждая сейчас о времени,  вспомним  пример, кажущийся очень простым,
-- один из парадоксов Зенона. Зенон относит свои парадоксы  к  пространству,
мы применим их ко времени.  Возьмем  самый простой из  всех -- парадокс, или
апорию, о движущемся.  Движущийся предмет находится в  одной  точке  стола и
должен попасть в другую точку. Вначале ему необходимо покрыть половину пути,
но  перед  тем  -- пересечь  половину  половины, а  еще  раньше --  половину
половины половины, и  так до бесконечности.  По  Зенону,  движущийся предмет
никогда  не переместится от одного края  стола  к другому. Наконец, мы можем
обратиться к примеру из  геометрии. В геометрии  придумали точку. Считается,
что точка  не  имеет никакой протяженности. Если  же  мы возьмем бесконечную
последовательность  точек, то  это  будет линия.  Затем возьмем  бесконечное
количество линий и получим плоскость. Не знаю, до какой степени это доступно
пониманию. Ведь если точ-
     ка  не имеет  протяженности,  непонятно,  как может  сумма  хотя  бы  и
бесконечного их числа  дать нам протяженную линию. Говоря о линии, я не имею
в  виду прямую, соединяющую эту точку  земли с луной.  Я думаю, к примеру, о
линии стола, до которого  я дотрагиваюсь. В ней также бесконечное количество
точек. Для всего этого было предложено объяснение.
     Бертран  Рассел  объясняет  это  так.  Существует  финитное   множество
(натуральный  ряд 1,  2, 3, 4,  5, 6, 7, 8, 9, 10 и  так до  бесконечности).
Рассмотрим теперь  другую последовательность,  протяженностью  вдвое  меньше
первой. Она состоит из четных  чисел. Тогда 1  соответствует 2, 2 -- 4, 3 --
6... Теперь возьмем еще одну последовательность. Выберем произвольное число.
Например,  365. Пусть теперь 1 соответствует 365, 2  -- 365 в квадрате, 3 --
365 в кубе. Мы получим несколько бесконечных  последовательностей чисел. Так
вот,  в подобных трансфинитных множествах  части не меньше целого. Насколько
мне  известно, эти идеи были приняты математиками, но я не понимаю,  как  им
может поверить наше воображение.
     Возьмем   настоящее  мгновение.  Что  такое  настоящее  мгновение?  Это
мгновение, в котором  есть  немного прошлого  и немного  будущего. Настоящее
само по себе подобно  финитной точке в геометрии. Настоящее само по себе  не
существует.  Оно  не является непосредственным восприятием нашего  сознания.
Итак, у нас есть настоящее, которое постоянно оборачивается то  прошлым,  то
будущим. Существует два взгляда на время. Согласно одному из них, который, я
думаю,  разделяем  все  мы,   время  --   река,  текущая  к  нам  от  своего
непостижимого  начала. Иначе  смотрит  на  время английский метафизик Джеймс
Брэдли. Брэдли говорит, что происходит  как раз обратное, что время течет из
будущего в настоящее, а тот момент, в  котором будущее становится прошлым, и
есть  то,  что  мы  называем  настоящим.  Мы  можем  выбирать   между  двумя
метафорами. Мы можем поместить истоки реки времени в будущее или в  прошлое.
Это все равно.  В обоих случаях река будет  течь. Но  как разрешить проблему
происхождения  времени?  Платон  дал  такой  ответ:  время  берет  начало  в
вечности.  Однако  это  не значит, что вечность  предшествует времени.  Ведь
сказать "предшествует" -- значит сказать, что вечность относится ко времени.
Ошибочно также  пола-гать вслед  за Аристотелем, что время -- мера движения,
потому  что  движение осуществляется во времени  и не  может  его объяснить.
Святой  Августин однажды прекрасно сказал:  "Non in tempore, sed cum tempore
Deus creavit caela et terrain" ("He во времени создал Бог небеса и землю, но
Он  наделил их временем").  Первые стихи  книги Бытия относятся не  только к
творению  мира --  творению  морей, земли,  мрака,  света,  -- но и к началу
времени.  Раньше  времени  не  было.  Мир   начал  существовать,  наделенный
временем, и с тех пор все в нем происходит последовательно.
     Не знаю, поможет ли нам идея трансфинитных  множеств, которую  я только
что  объяснил. Не знаю, свыкнется ли с этой идеей мое воображение, не  знаю,
свыкнется ли с этой идеей ваше воображение.  С идеей множеств, части которых
были бы  равны  целому.  Говоря о  последовательности натуральных  чисел, мы
понимаем, что  количество четных  чисел  равно  количеству  нечетных, и  оно
бесконечно.  Мы  понимаем, что  количество  степеней  365  равно  количеству
натуральных чисел.  Почему  бы  нам не применить эту идею  и к двум моментам
времени? Почему  не применить ее  к  7  и 4 минутам, 7 и  5  минутам? Трудно
поверить,  что   между  этими   двумя  числами   располагается   бесконечная
трансфинитная последовательность мгновений.
     Однако Бертран Рассел хочет, чтобы мы представляли это себе именно так.
     Бергсон сказал, что парадоксы  Зенона  основаны на уподоблении  времени
пространству, что  в  действительности  существует  лишь  цельный  жизненный
порыв.  Так, нельзя  говорить,  что, в то время как Ахиллес  пробегает метр,
черепаха пробегает дециметр, потому что при таких рассуждениях Ахиллес бежит
сначала большими шагами, а  затем шажками  черепахи. То есть мы прикладываем
ко  времени  пространственную мерку. Рассмотрим временной  промежуток в пять
минут. Чтобы пролило  пять  минут, необходимо,  чтобы прошли две с половиной
минуты, их половина, а для этого должна пройти  и  половина двух с половиной
минут. Чтобы прошла эта половина, должна пройти  половина половины и  так до
бесконечности.   Пять  минут   никогда  не  кончатся.  Так,  с   аналогичным
результатом, апории Зенона прикладываются ко времени.
     Возьмем также  пример со стрелой. Зенон говорил, что стрела  в полете в
каждое  мгновение  неподвижна.  Значит,  движение  невозможно:   ведь  сумма
неподвижностей не может дать движение.
     Но  если мы сочтем пространство реально существующим, то можно  в конце
концов разделить его  до точки, хотя  бы процесс деления и  был бесконечным.
Если  решить, что  время  реально  существует, то  можно  разделить  его  на
мгновения, на мгновения мгновений и так
     далее.
     Посчитав мир созданием  нашего воображения,  решив, что каждый из нас в
грезах  создает свой  мир,  мы  могли  бы  предположить, что  наше  мышление
движется от одной мысли к другой и подразделений, о которых говорилось выше,
не существует.  Есть  лишь то,  что  мы  ощущаем, только наши  эмоции,  наше
воображение. Это  подразделение --  не  подлинное, воображаемое. Но бытует и
другая общепринятая точка  зрения, заключающаяся  в представлении о единстве
времени. Ее  утвердил  своим авторитетом  Ньютон,  но  она была принята  еще
задолго  до  него.  Когда Ньютон  говорит  о  математическом  времени  -- об
одном-единственном времени, которое  струится  во вселенной, --  он имеет  в
виду  то время, которое и сейчас единообразно течет в пустоте, в межзвездном
пространстве. Но английский метафизик Брэдли  заявил, что считать так у  нас
нет никаких оснований.
     Можно предположить, что существуют разные временные последовательности,
несоотносимые между собой, писал он.  Возьмем одну из них и обозначим ее  а,
b, с, d, e, f... Члены ее соотносятся друг с другом: одно следует за другим,
одно  следует перед другим, одно одновременно другому. Мы могли бы придумать
другую последовательность: альфа,  бета,  гамма...  Можно придумать и многие
другие последовательности.
     Почему  мы  считаем  время  одной-единственной последовательностью?  Не
знаю, доступна ли нашему воображению идея, что существует множество времен и
эти  временные последовательности  не  соотносятся  друг  с другом, хотя  их
члены, разумеется, следуют друг за другом, друг перед другом и  одновременно
друг с другом. Это разные  последовательности. Каждый из  нас может себе это
представить. Вспомним хотя бы о Лейбнице.
     Дело   в  том,  что  жизнь  каждого  из  нас  есть  не  что  иное,  как
последовательность   событий,  и   разные   последовательности   могут  быть
параллельны  или пересекаться. Почему  мы должны принять эту идею? Возможно,
она верна и тогда даровала бы нам мир обширнее, необычнее того, в котором мы
живем.  Мысль,  что  не  существует  единого  времени,   мне  кажется,  была
воспринята современной физикой, которую я не понимаю и не знаю. Это мысль  о
разных  временах. С какой стати мы должны вслед за Ньютоном утверждать,  что
существует лишь одно время?
     Вернемся  теперь  к  теме вечности,  к  идее  вечности,  которая  хочет
каким-то  образом   проявиться  и  которая  проявляется   во  времени   и  в
пространстве. Вечность  --  мир архетипов.  Так,  в  вечности  не существует
конкретных треугольников. Там  имеется  лишь  один  треугольник, который  не
будет   ни  равносторонним,  ни  равнобедренным,   ни  разносторонним.  Этот
треугольник -- одновременно все  три и ни один  из них.  То, что мы не можем
себе представить этот треугольник, не имеет значения. Он существует.
     Или же,  к  примеру, каждого из  нас можно считать временной и смертной
копией  архетипа  человека. Здесь  перед  нами встает  еще одна  проблема: у
каждого ли человека есть свой платоновский  архетип?  Этот абсолют стремится
проявить себя, и он проявляется во времени. Время -- образ вечности.
     Я думаю, что это помогло бы  нам понять, почему время  последовательно.
Время  последовательно,  потому   что,  выйдя  из  вечности,  оно  стремится
вернуться к ней.  Таким образом,  идея  будущего  связана  с нашим  желанием
вернуться  к началу. Бог создал мир, и весь  мир, вся сотворенная  вселенная
стремится  вернуться к  своему вечному источнику, лежащему не после  времени
или до него, но за его пределами.  И это проявляется в жизненном порыве.  Мы
поняли также, почему время постоянно движется. Некоторые отрицают настоящее.
Индийские  метафизики утверждают,  что нет мгновения, в которое падает плод.
Плод  вот-вот упадет  или уже лежит на земле, но нет мгновения, в которое бы
он падал.
     Как парадоксально,  что из  трех времен,  на которые мы делим время, из
прошлого, настоящего и будущего, самым сложным, самым неуловимым оказывается
настоящее!  Настоящее неуловимо, как точка.  Ведь  если представить себе его
без протяженности, оно окажется несуществующим.  Мы должны представлять себе
настоящее,   которое  было  бы  немного  прошлым  и  немного  будущим.   Так
чувствуется ход времени. Когда я говорю о  ходе времени, то говорю о чем-то,
что все мы  чувствуем. Когда я  говорю о  настоящем  времени,  то  говорю об
абстрактной сущности.  Настоящее не  есть непосредственное восприятие нашего
сознания.
     Мы чувствуем, что скользим во времени, то есть  можем представить себе,
что движемся от будущего к прошлому или от  прошлого  к  будущему. Но нам не
дано остановить время, воскликнув вслед за Гете:  "Остановись, мгновенье, ты
прекрасно!" Настоящее не останавливается. Невозможно представить себе чистое
настоящее. Оно  было бы ничем. В  настоящем всегда  есть частица прошлого  и
частица  будущего. Видимо,  это  необходимо  для  времени. В нашем жизненном
опыте  время  всегда подобно  реке Гераклита,  мы постоянно  вспоминаем  это
старое сравнение,  как  будто бы ничего  не  изменилось за столько  веков, и
по-прежнему   остаемся  Гераклитом,  видящим   в  реке  свое   отражение   и
размышляющим  о том, что река -- не река, потому что вода изменилась,  и сам
он не Гераклит, потому что  и  он изменился с тех  пор,  как в последний раз
смотрел на реку. Таким образом,  мы и  текучи, и постоянны,  мы загадочны по
своей сути. Кем был бы каждый из нас без своей памяти? Наша память во многом
состоит из  хлама, но в ней -- суть человека. К примеру, чтобы быть тем, кто
я есть, мне  нет надобности вспоминать, что я жил в Палермо, Адроге, Женеве,
в Испании. В то же время я должен чувствовать, что я не такой,  какой  был в
тех  местах,  что  я стал другим. Это проблема, которую мы никогда не сможем
решить,  -- проблема  изменчивого тождества.  Может быть, достаточно  самого
слова  "изменение".  Ведь если говорить об изменении чего-то, это не значит,
что оно было заменено другим. Когда мы говорим: растение растет, то не имеем
в виду, что на месте данного растения выросло другое, больше его. Мы
     хотим сказать, что это растение становится другим. Это идея постоянства
в изменчивом.
     Представление  о  будущем  должно  было  бы  подтвердить  старую  мысль
Платона, что время -- текучий образ вечности. Если  время -- образ вечности,
то будущее должно быть движением души к грядущему. Грядущее, в свою очередь,
будет  возвращением  к  вечности.  Наша жизнь становится  тогда каждодневной
агонией.  Когда Святой Павел  сказал: "Я умираю  каждый день",  это  не было
поэтическим  образом. Истина в том,  что мы  каждый  день  умираем  и  вновь
рождаемся. Поэтому  время затрагивает нас  больше, чем другие метафизические
проблемы,  -- ведь они абстрактны. Проблема времени непосредственно касается
всех  нас.  Кто  я есть?  Кто  есть каждый из  нас? Кто  все  мы?  Возможно,
когда-нибудь мы  это и узнаем. А может, и нет. Пока  же, как  сказал  Святой
Августин, душа моя жаждет это познать


          Хорхе Луис Борхес. Эмануэль Сведенборг




     Вольтер  как-то заметил, что самым необычным  человеком  на  протяжении
всей  истории был Карл XII.  Если уж говорить в превосходной степени, то, на
мой  взгляд, самым необыкновенным человеком был  загадочный  подданный Карла
XII Эмануэль Сведенборг. Сначала я скажу  несколько  слов о нем, после этого
мы перейдем к главному -- его учению.
     Эмануэль Сведенборг родился в Стокгольме в 1688 году, а умер  в Лондоне
в 1772-м. Долгая жизнь. Если же мы вспомним, как коротка была  людская жизнь
в  те времена, то она покажется  нам  еще  более  долгой. В его  жизни легко
выделяются три периода, каждый из них был периодом интенсивной деятельности,
и каждый длился, как подсчитали, по двадцать восемь  лет. Вначале перед нами
человек,   посвятивший  себя  занятиям.  Отец  Сведенборга  был  лютеранским
епископом, и Сведенборг воспитывался  в лютеранской вере, в  основе которой,
как известно, лежит учение о спасении по благодати.  Впоследствии Сведенборг
разочаруется в этом учении. В его системе, в проповедуемой  им новой религии
спасение  достигается  делами,  и  это, разумеется,  не  мессы и  обряды, но
реальные дела, дела, в которые человек вовлекается целиком, -- и дух его, и,
что особенно важно, разум его.
     Так вот, Сведенборг  начал как  священник, но  вскоре  увлекся науками.
Науки интересовали  Сведенборга прежде всего  в их практическом  приложении.
Впоследствии было обнаружено, что  он предвосхитил многие  позднейшие  идеи,
например небулярную  гипотезу Канта--Лапласа. Кроме того,  как и Леонардо да
Винчи, Сведенборг сделал чертеж летательного аппарата. Он знал,  что  это не
могло иметь практического применения, но расценивал свою работу как исходную
точку  для  создания  того,  что мы  сейчас называем самолетами.  Сведенборг
сделал  также  чертеж аппарата, способного плавать под водой; о таком  писал
еще Фрэнсис Бэкон. Затем он заинтересовался --  тоже  неординарное увлечение
-- минералогией. Он  был  асессором  Горной  коллегии в Стокгольме,  но  его
привлекала  и  анатомия. Подобно  Декарту, он пытался определить то место, в
котором дух связывается с телом.
     Эмерсон  сказал  о  Сведенборге:  к  сожалению,  он  оставил  нам  лишь
пятьдесят  томов. Пятьдесят томов, по крайней мере двадцать  пять из которых
посвящены науке,  математике, астрономии. Сведенборг  отказался  от  кафедры
астрономии в Упсальском  университете;  он был практиком, и его  отталкивала
всякая теоретическая деятельность. Сведенборг стал  военным инженером  Карла
XII, и тот высоко  его ценил.  Они много общались: герой и будущий провидец.
Сведенборг изобрел машину для перемещения кораблей по суше, которую Карл XII
использовал в своих легендарных войнах,  так  прекрасно описанных Вольтером.
При помощи этой машины корабли были перевезены на расстояние двадцати миль.
     Позднее  Сведенборг  переселился в  Лондон. Там он  освоил  плотницкое,
столярное,  типографское  ремесла,  организовал  производство  инструментов.
Кроме  того, он  чертил карты для  глобусов.  Одним  словом,  Сведенборг был
абсолютно  практическим человеком.  Мне вспоминаются слова Эмерсона: ни один
человек  не  прожил  более  реальной жизни, чем Сведенборг.  Надо помнить об
этом,  чтобы  видеть  весь  размах  его научной и практической деятельности.
Сведенборг был еще и  политиком,  он стал сенатором королевства. В пятьдесят
пять   лет   Сведенборг   уже  опубликовал  примерно  двадцать   пять  томов
исследований по минералогии, анатомии и геометрии.
     Тогда-то и произошло главное  событие в его  жизни. Этим событием  было
откровение.  Оно снизошло на Сведенборга в Лондоне; как  было отмечено в его
дневнике, откровению предшествовали сны.
     Сведенборг не описывал их, но известно, что это были эротические сны.
     Затем было посещение; некоторые посчитали это припадком безумия. Однако
это  опровергается  ясностью  его  трудов,  при  чтении  которых никогда  не
возникает чувство, что они написаны сумасшедшим.
     Объясняя свое учение, Сведенборг всегда пишет очень понятно. В  Лондоне
какой-то  незнакомец  шел за  ним по улице и, войдя  в  его дом, назвал себя
Иисусом Христом. Он сказал, что Церковь приходит в упадок, подобно еврейской
церкви перед  приходом Христа, и что  Сведенборг  должен обновить ее, создав
третью церковь, церковь Иерусалима.
     Это  кажется  нелепым, невероятным,  но  остались труды Сведенборга. Их
много, и написаны они в  очень спокойной манере.  Он никогда  не рассуждает.
Вспомним  известное  высказывание  Эмерсона:  аргументы никого не  убеждают.
Сведенборг  авторитетно  все  излагает, со  спокойной уверенностью  в  своей
правоте.
     Итак,  Иисус  сказал  Сведенборгу,  что  на  того  возложена  миссия по
обновлению  Церкви. Он сказал, что Сведенборгу будет  позволено посетить мир
иной, мир  духов с бесчисленным  количеством  небес и адов.  Он сказал,  что
Сведенборг  должен  изучить  Священное  Писание.  И  прежде  чем  что-нибудь
написать, Сведенборг посвятил два года изучению еврейского языка, потому что
он  хотел  читать  Священные  тексты  в  оригинале.  Он  снова  принялся  их
штудировать  и  усмотрел  в  них  основу  для  своего  учения.  Это  немного
напоминает  каббалистов, которые основываются в своих  поисках на  Священных
текстах.
     Рассмотрим прежде всего представления Сведенборга о потустороннем мире,
о бессмертии  души, в  которое он  верил. В  "Божественной комедии" Данте --
прекрасной  книге  с литературной точки  зрения -- свободная воля исчезает в
момент смерти.  Мертвых  предают  суду  и  направляют  в  рай  или  в  ад. У
Сведенборга  ничего подобного не  происходит.  Он  пишет,  что, скончавшись,
человек не сразу понимает, что  умер; ведь вокруг него ничего не изменилось.
Он пребывает в своем доме, его  посещают друзья, он гуляет по улицам  своего
города, и ему не приходит в голову,  что он умер; но постепенно  он начинает
кое-что замечать. То, что он замечает, сначала радует его, а затем тревожит:
в потустороннем мире все более жизненно, чем в нашем.
     Мы  всегда  довольно туманно представляем себе  мир иной, но Сведенборг
говорит  нам, что  на самом деле все наоборот; ощущения там становятся более
яркими.  Например,  там больше  красок. Вспомнив,  что  в сведенборском  раю
ангелы, где бы они ни были, всегда предстоят пред ликом Господа, мы невольно
думаем о  чем-то вроде четвертого  измерения.  Во всяком случае,  Сведенборг
вновь  и  вновь повторяет, что мир иной более наполнен  жизнью, чем наш. Там
множество красок,  форм.  Там все конкретнее, осязаемее,  чем  в  этом мире.
Разница  настолько велика,  говорит Сведенборг,  что мир  наш  в сравнении с
миром бесчисленного рая и ада, по которому
     он странствовал, подобен лишь тени. Мы словно живем в тени.
     Мне вспоминается одно высказывание  Святого Августина в "Граде Божием".
Он пишет,  что чувственные наслаждения в земном раю несомненно были сильнее,
чем  в нашем мире: ведь падение не могло ничего улучшить. Сведенборг говорит
то же  самое.  Он  рассказывает  о  плотских наслаждениях в  раю и в  аду  и
утверждает, что они гораздо сильнее, чем у нас.
     Что же происходит, когда человек умирает? Сначала  он не понимает,  что
умер. Он занят своими обычными делами, его навещают друзья, он разговаривает
с ними. Затем, мало-помалу, он с  тревогой начинает замечать, что  все стало
живее,  чем было, что вокруг  больше  красок. Человек думает:  я  всю  жизнь
прожил в  тени, а  сейчас живу  в ярком  свете.  И  эта мысль  может  его на
мгновение обрадовать.
     А потом к человеку приходят незнакомцы и беседуют с ним. Эти незнакомцы
--  ангелы и  демоны. Сведенборг  пишет, что  ни ангелы, ни  демоны не  были
созданы  Богом  такими, какие  они есть. Ангелы  -- это люди,  возвысившиеся
настолько, что стали ангелами, демоны -- люди, павшие столь низко, что стали
демонами.  Таким  образом,  и  рай и  ад населены  людьми,  ставшими  теперь
ангелами и  демонами.  Итак,  к  умершему приходят  ангелы.  Бог  никого  не
приговаривает к аду. Бог хочет, чтобы спаслись все люди.
     Но  в  то  же  время  Бог предоставляет человеку  свободную  волю,  эту
страшную привилегию,  дающую  возможность заточить себя в аду  или заслужить
рай.  Иначе говоря, Сведенборг распространяет  на потусторонний мир действие
свободной воли, которая, согласно  ортодоксальной доктрине,  существует лишь
при   жизни.  Как   видим,   между  двумя  мирами,   по  Сведенборгу,  лежит
промежуточная  область --  область  духов.  Там  живут  люди, души  умерших,
беседующие с ангелами и демонами.
     Но однажды настанет момент -- он  может не наступать неделю, или месяц,
или долгие годы, -- словом,  неизвестно, сколько времени,  --  когда человек
принимает  решение: стать  ему  демоном или  ангелом.  В  первом  случае ему
уготован ад. Ад -- край  равнин и расщелин. Расщелины  могут  уходить  вниз,
соединяя  друг с другом  преисподние, или же вверх, соединяя ад  с небесами.
Человек сравнивает, разговаривает, выбирает общество по своему вкусу. Если у
него демонический нрав, он предпочтет общество демонов. Если  ангельский  --
общество ангелов. Куда более красноречивое  изложение всего этого вы найдете
в третьем акте "Человека и сверхчеловека" Бернарда Шоу.
     Интересно,  что Шоу  нигде  не  упоминает Сведенборга. Думаю,  Шоу  сам
пришел  к  схожим  идеям.  Система  Джона  Тэннера  тесно связана с  учением
Сведенборга,  но  имени  Сведенборга  в пьесе  нет. На  мой  взгляд,  это не
плагиат. Шоу сам  пришел к таким взглядам, видимо, через Уильяма  Блейка,  в
книгах которого содержится проповедуемое Сведенборгом учение о спасении.
     Итак,  человек  беседует  с  ангелами,  беседует  с  демонами,  и  одни
привлекают его больше, чем другие. Это зависит от характера самого человека.
Заточающим себя в ад -- ведь Бог не приговаривает никого -- нравятся демоны.
Тогда  что  же  такое ад  по Сведенборгу? Ад -- явление неоднозначное.  Мы и
ангелы воспринимаем  его  по-разному. Ад --  болотистая страна  с сожженными
дотла городами, но грешники там чувствуют себя счастливыми.  Счастливыми  на
свой лад -- они полны ненависти. В их государстве нет монарха, они постоянно
плетут интриги друг против друга. Это  мир грязной политики  и интриг. Таков
ад.
     Другая часть потустороннего  мира -- рай, противоположный аду. Ведь рай
и ад  симметричны. Согласно  Сведенборгу -- и это  самая  трудная часть  его
доктрины  --   для  существования  мира  необходимо  равновесие  небесных  и
дьявольских сил. Но  повелевает этим равновесием всегда Бог.  Бог  позволяет
адским духам находиться в аду, потому что в аду они счастливы.
     Сведенборг рассказывает нам об одном демоне, который поднялся на  небо,
вдохнул  небесный аромат, услышал беседы ангелов. Но все  там показалось ему
ужасным.  Благоухание показалось  зловонием,  свет  --  мраком.  И  тогда он
вернулся в ад, потому что только в аду может  быть счастлив. Небо -- это мир
ангелов.  Сведенборг добавляет,  что сам ад имеет  форму демона,  а  рай  --
ангела.  Рай  состоит  из  отдельных  сообществ  ангелов.  Там  Бог.  И  Бог
представлен нам солнцем.
     Таким образом, солнце соответствует Богу, а худшие адские области лежат
на  севере  и  западе.  Наоборот,  на востоке  и юге ад отличается некоторой
мягкостью.  Никто не приговаривается к  тому или иному аду. Каждый ищет себе
общество по вкусу, ищет друзей  по  вкусу,  ищет в соответствии с желаниями,
владевшими им в жизни.
     Те, кто  достигает рая,  имеют о нем ложное представление.  Они думают,
что  в раю  надо  постоянно  молиться, и  им  позволяют  молиться, но  через
несколько дней  или недель им это надоедает. Они понимают, что  рай  не  для
этого. Тогда они начинают  восхвалять  и славить Бога. Но Богу  не  нравятся
восхваления, а им  вскоре  надоедает  славить  Бога. И тогда они решают, что
могут  обрести  счастье, беседуя  со  своими  близкими.  Но вскоре  начинают
понимать, что и близкие, и знаменитые герои могут быть так же докучны в раю,
как и на земле. Им надоедает все это, и  вот  тут-то  они постигают истинное
назначение рая. Мне вспоминается одно стихотворение Теннисона, где он пишет,
что  душа не  желает роскошных  жилищ. Она хочет  лишь  одного --  чтобы  ее
одарили возможностью жить и не умирать.
     В общем, рай Сведенборга --  это рай любви и труда. Это мир альтруизма.
Каждый  ангел  работает  для  других,  все  трудятся  друг  для  друга.  Там
недопустима  праздность.  Рай не является вознаграждением.  Если  у человека
ангельский  нрав,  он  будет   жить   в  раю  и  ему   будет  хорошо.  Но  у
сведенборговского рая есть еще одна очень важная особенность: его обитателям
присуща высокая степень интеллекта.
     Сведенборг рассказывает трагическую историю человека, который  всю свою
жизнь стремился заслужить рай. Он отказался от всех чувственных наслаждений,
удалился в пустыню. Там он был сосредоточен лишь  на  одном: молился, просил
рая. То есть он обеднял себя. Что же случилось,  когда он  умер? Он пришел в
рай, а в раю  не  знали, что с ним  делать. Он пытался участвовать в беседах
ангелов, но не понимал их. Пытался постичь искусства и все услышать, во всем
разобраться,  но  не  смог  сделать  этого,  потому  что обеднел духовно. Он
просто-напросто  был  человеком праведным,  но бедным разумом.  И  тогда ему
предоставили возможность сотворить  для себя  образ пустыни. В этой пустыне,
оставаясь в  раю, он молился, как молился на  земле. Он понял,  что покаяние
сделало его  недостойным неба, потому что он  обеднил свою жизнь, потому что
отказался -- что также плохо -- от ее радостей и наслаждений.
     Эти идеи -- новшество Сведенборга. Всегда считалось, что спасение носит
этический характер.  То есть,  если человек  праведен, он спасется. Блаженны
нищие  духом,  ибо их есть  царство  небесное и т. п. Так  говорит Иисус. Но
Сведенборг  идет  дальше. Он  утверждает, что этого мало, что человек должен
спастись и посредством разума. Он представляет себе рай прежде всего как ряд
теологических  бесед ангелов,  и  тот,  кто  не  может  в  них  участвовать,
недостоин  неба. Он должен жить  в одиночестве. А после  Сведенборга  Уильям
Блейк будет проповедовать третье спасение. Он скажет, что мы можем -- что мы
должны --  спастись  также  посредством  искусства. Блейк  объясняет, что  и
Христос  был   художником;   ведь  все   его   проповеди  иносказательны.  А
иносказания,  разумеется, эстетические  средства  выражения. Таким  образом,
спасение достигается разумом, нравственностью и занятиями искусством.
     Вспомним   несколько  высказываний,  к  некоторым  Блейк  свел  длинные
сентенции Сведенборга. Например: глупец не войдет на  небо,  каким бы святым
он ни был. Или: надо отвергнуть святость и уповать на разум.
     Итак,  перед нами  три мира.  Умерев, человек попадает в  мир духов,  а
затем, через какое-то время,  одни заслуживают  рая, другие заслуживают ада.
На самом деле  ад управляется Богом, ибо Бог поддерживает равновесие. Сатана
-- просто название одной из областей  ада. Демоны постоянно меняют свой вид,
ведь ад -- мир заговоров, где все ненавидят друг друга и объединяются только
для того, чтобы на кого-нибудь напасть.
     Сведенборг разговаривал с  разными  обитателями рая  и  ада.  Ему  было
дозволено  это,  чтобы  он смог  основать  новую  церковь. И  что  же делает
Сведенборг?  Он  не  занимается проповедями, но анонимно выпускает  книги на
сухой и строгой латыни. Он распространяет свои труды. Так проходят последние
тридцать лет  его  жизни.  Сведенборг вел в Лондоне  очень  скромную  жизнь,
питаясь лишь  молоком, хлебом,  овощами.  Иногда к нему  приезжали друзья, и
тогда он позволял себе несколько дней отдыха.
     Приехав в Англию, Сведенборг хотел познакомиться с Ньютоном, потому что
его очень интересовало новое в астрономии, закон тяготения. Но они  так и не
встретились.  Сведенборг интересовался  и английской поэзией. В своих трудах
он упоминает Шекспира, Мильтона и
     других. Он  хвалит этих поэтов за их  воображение, одним словом, у него
был  хороший вкус.  Известно,  что  в  своих  поездках (он  путешествовал по
Швеции, Англии,  Германии,  Австрии,  Италии)  Сведенборг посещал  фабрики и
бедные  кварталы. Ему очень нравилась  музыка.  Он  был  типичным дворянином
своего времени. Он стал богатым человеком. В Лондоне слуги  Сведенборга жили
на  первом  этаже его  дома  (дом этот был недавно  снесен)  и  неоднократно
видели, как он беседует с ангелами и спорит с демонами.  Сведенборг в спорах
никогда не навязывал своих  идей. Разумеется, он не позволял насмехаться над
своими  видениями,  но  и  не  хотел  их  навязывать, предпочитая переводить
разговор на другие темы.
     Есть  существенная разница между  Сведенборгом  и другими мистиками.  К
примеру, у Сан-Хуана де ла Круса мы находим очень живые описания экстаза. Он
передает это состояние в эротических терминах,  сравнивает его с опьянением.
Он пишет о встрече человека с Богом, который обликом своим  был подобен ему.
Для описания  этого  им  разработана  целая  система метафор.  В  трудах  же
Сведенборга нет ничего подобного. Это труды человека, который объездил много
неизведанных земель и спокойно, подробно рассказал о них.
     Поэтому книги Сведенборга не  развлекательны в собственном смысле этого
слова. Они постепенно затягивают в себя. Я  прочел четыре тома Сведенборга в
переводе на английский, опубликованные в  "Эвриманс Лайбрери". Мне говорили,
что существует и испанский перевод избранных произведений,  опубликованный в
"Эдитора  Насиональ". Я видел записи нескольких лекций  о Сведенборге, в том
числе блистательной лекции, прочитанной Эмерсоном. Он прочитал цикл лекций о
выдающихся людях: "Наполеон, или Светский  человек", "Монтень, или Скептик",
"Шекспир, или Поэт", "Гете, или Литератор",  "Сведенборг, или  Мистик".  Эта
замечательная лекция была  первой работой  о  Сведенборге, которую я прочел.
Эмерсон не все принимает в Сведенборге. Что-то в  нем  отталкивало Эмерсона,
возможно,   его  скрупулезность,  догматизм.  Ведь  Сведенборг  неоднократно
настаивает  на своем,  повторяет  одну и ту  же мысль, не  ищет аналогий. Он
напоминает путешественника, объехавшего  необычайные страны --  бесчисленные
небеса и преисподние -- и описывающего их. А теперь обратимся к
     другой теме, которую развивает Сведенборг:  к  учению  о соответствиях.
Мне  кажется,  что  он  придумал  эти соответствия  для  того,  чтобы  найти
обоснование своему  учению в Библии. По  Сведенборгу, каждое слово  в Библии
имеет  по меньшей мере два значения. Данте пишет о четырех значениях каждого
места в Библии.
     Любое слово должно  быть  прочитано  и  проинтерпретировано. К примеру,
слово "свет" для  Сведенборга -- метафора,  очевидный  символ  истины.  Конь
обозначает  разум:  ведь  конь  переносит  нас из  одного  места  в  другое.
Сведенборг выработал  целую систему соответствий, и в этом он очень похож на
каббалистов.
     Затем   Сведенборг   пришел  к  мысли,   что   весь   мир  строится  на
соответствиях.  Творение  --  это  тайнопись,  криптограмма,  нуждающаяся  в
расшифровке.  Все сущее на самом деле --  слова, хотя скрытого смысла многих
из  них  мы не  понимаем  и вынуждены принимать  их в буквальном значении. Я
вспоминаю  страшный приговор  Карлейля, не  без пользы  для себя  изучавшего
Сведенборга: "Всемирная история -- это письмена, которые мы должны постоянно
читать  и писать". Так оно и  есть:  мы постоянно присутствуем  на спектакле
всемирной  истории,  и сами же являемся ее актерами.  Мы --  буквы,  и мы --
алфавит Божественного текста, на котором нас пишут. Дома у меня есть словарь
соответствий. В нем можно найти любое слово из Библии  и узнать, какой смысл
приписывает ему Сведенборг.
     Разумеется, Сведенборг верил в спасение  делами. Делами не только духа,
но  и ума.  Это  спасение разумом. В  раю Сведенборга ангелы главным образом
ведут теологические  диспуты, беседуют  друг с другом.  Но рай  также  полон
любви.  Там  заключаются браки. Все,  что ни есть чувственного  в этом мире,
есть и в раю. Сведенборг ни от чего не отказывается, ничего не обедняет.
     В  настоящее  время  существует  сведенборгианская  церковь.  По-моему,
где-то в  Соединенных  Штатах  они построили хрустальный собор. Эта  церковь
имеет  несколько  тысяч  последователей  в  Соединенных  Штатах,  в  Англии,
особенно  в  Манчестере, в Швеции и Германии. Отец Уильяма и  Генри Джеймсов
был  сведенборгианцем.  Я  встречался  со  сведенборгианцами  в  Соединенных
Штатах,  там они образовали общину и продолжают публикацию книг Сведенборга,
переводят их на английский язык.
     Интересно, что, хотя  труды Сведенборга были переведены на многие языки
(даже  на  хинди  и  на  японский),  они  не  имели  значительного  влияния.
Сведенборг не достиг того обновления церкви, к которому стремился.  Он хотел
основать новую церковь в христианстве, подобно тому как раньше была основана
церковь протестантская.
     Сведенборгианская   церковь  во   многом   вышла   из   католической  и
протестантской церквей. Но она не оказала столь значительного влияния, какое
могла бы оказать.  На  мой взгляд, это  связано с общим скандинавским роком.
Кажется,  все, что  происходит в Скандинавии,  происходит  словно во сне или
внутри  стеклянной сферы.  Например,  викинги  открыли Америку  за несколько
веков до Колумба, но это ни к чему не  привело.  Роман начался  с исландских
саг,  но   это  литературное  новшество  не   получило  распространения.   В
скандинавской истории есть личности мирового масштаба, например Карл XII. Но
мы в первую  очередь вспоминаем других завоевателей, хотя их военные деяния,
возможно,  сильно уступали  подвигам Карла XII. Идеи Сведенборга должны были
полностью  обновить  церковь, но их постигла общая скандинавская участь, они
будто остались сновидением.
     Я знаю, что в Национальной библиотеке хранится экземпляр книги  "О рае,
аде и  их  чудесах".  Но в теософских  книжных магазинах нередко отсутствуют
труды Сведенборга.  Между  тем  он  более интересный  мистик, чем другие. Те
говорят только,  что они  почувствовали экстаз,  и пытаются передать  его  в
литературной форме. Сведенборг -- первый исследователь  потустороннего мира,
исследователь, к которому надо относиться серьезно.
     Говоря о  Данте,  который  также  описывает  Ад, Чистилище  и  Рай,  мы
понимаем, что это литературный  вымысел. Мы не можем на самом деле поверить,
что  Данте  видел все описанное им. Кроме того, Данте писал  стихами,  и это
связывало  его.  Ведь  стих  все-таки  не  первичная  форма   для  выражения
пережитого.
     Сведенборг  оставил много  трудов. Это такие работы,  как "Христианская
религия и Божественное Провидение" и  уже упомянутая мной книга о рае и аде,
которую я рекомендую вам прочесть. Она издавалась на латинском,  английском,
немецком, французском языках  и,  мне  кажется,  на испанском языке.  В  ней
учение Сведенборга изложено  очень  четко. Смешно  утверждать, что эту книгу
написал сумасшедший.  Сумасшедший не  мог бы  писать так  ясно. Кроме  того,
видения изменили всю жизнь Сведенборга. Он оставил науку, решив, что занятия
ею были лишь Божественной подготовкой для иных трудов.
     С этого момента Сведенборг  посвятил себя им, он путешествовал по раю и
аду,  беседовал с  ангелами,  с  Иисусом и описал  все это  в очень точном и
строгом  стиле,  без  метафор  и  гипербол.  В  его  книгах  много  живых  и
запоминающихся историй, вроде той, которую я вам рассказывал, -- о человеке,
хотевшем  заслужить  рай, но обеднившем  свою жизнь и  заслужившем  пустыню.
Сведенборг  предлагает  нам спастись, обогащая свою  жизнь.  Спастись  через
праведность, добродетель, а также через разум.
     А  потом  придет  Блейк  и  скажет,  что  человек  должен  быть  еще  и
художником.  Таким  образом,  получается  тройственное  спасение.  Мы должны
спастись посредством  добродетели  и  праведности,  абстрактного мышления  и
искусства

------------------------------------------------------------------------
Обращений с начала месяца: *25*, Last-modified: Tue, 22 Nov 2005 16:43:40 GMT
Оцените </HITPARAD/> этот текст:



